{
  "url": "https://www.ubicloud.com/docs/overview",
  "scraped_content": {
    "url": "https://www.ubicloud.com/docs/overview",
    "title": "Overview - Ubicloud Documentation",
    "sections": [],
    "full_text": "Overview - Ubicloud DocumentationUbicloud Documentation home pageSearch...⌘KAsk AISearch...Navigation OverviewDocumentationAPI ReferenceArchitectureChangelog OverviewQuickstartManaged ServicesBuild Your Own CloudUsing Kamal with UbicloudCLIAI InferenceInference EndpointsInference API KeysPlaygroundTutorial: Chat Completion (Python)Github Actions IntegrationQuickstartRunner TypesUse Premium RunnersMigrate to Arm runnersUse GPU RunnersUbicloud CacheDebug Workflow with SSH10x Price-PerformanceManaged PostgreSQLOverviewConnectionMetricsNetworkingResizingHigh AvailabilityRead ReplicasBackup and RestoreConfiguration and SettingsExtensionsPrice-PerformanceParadeDB on UbicloudManaged KubernetesOverviewQuickstartExpose an Application Securely Using TLSTutorial: Self-Hosting Windmill on Ubicloud for ProductionNetworkingPrivate SubnetFirewallLoad BalancerSecurityOverviewAuthorizationGitHub ActionsSOC2AboutPricingRegionsSupportPrivacy PolicyTerms of ServiceOn this pageWhat is Ubicloud?Why Ubicloud?LicensesProductReduce costs. Avoid lock-in. Win back your infrastructure. ​What is Ubicloud? Ubicloud is an open, free, and portable cloud. Think of it as an alternative to public cloud providers, like what Linux is to proprietary operating systems. Ubicloud offers infrastructure-as-a-service (IaaS) features on providers that lease bare metal instances, such as Hetzner, Leaseweb, and Latitude.sh. It’s also available as a managed service. The low cost of the bare metal instances we use in our managed service allows us to pass those low prices to you, reducing cloud costs by 3x - 10x. ​Why Ubicloud? Cloud services like AWS, Azure, and Google Cloud made life easier for start-ups and enterprises. But they are closed source, have you rent computers at a huge premium, and lock you in. Ubicloud offers an open alternative, reduces your costs, and returns control of your infrastructure back to you. All without sacrificing the cloud’s convenience. Today, AWS offers about two hundred cloud services. Ultimately, we will implement 10% of the cloud services that make up 80% of total consumption. Example workloads/reasons to use Ubicloud today include: You’re using GitHub Actions. Ubicloud supports managed x64 and arm64 runners; and reduces your bill by 10x. To get started, you just need to change 1 line in your workflow file. You need managed PostgreSQL. Ubicloud is open source and portable. This way, you can see how we operate and avoid cloud vendor lock-in. Our managed Postgres is also fast thanks to its use of local NVMe and costs 3x less than comparable solutions. You have batch processing workloads that are compute/memory intensive. For example, you’re doing scientific computing or video processing. You need secure virtual machines (VMs), encryption in-transit and at-rest; and you’d like to pay 3x less. ​Licenses Our GitHub repo is here: https://github.com/ubicloud/ubicloud available to use for free under the GNU Affero General Public License version 3 (AGPL v3). ​Product Existing cloud services and additional components include the following: Elastic Compute - Provision, use, and delete isolated VMs on bare metal Block Storage (non-replicated) - Block devices with encryption at rest Virtual Networking - Public and private networking. IPv4 and IPv6. Encryption in transit Load Balancer - Distributes traffic across VMs, built-in health checks Managed PostgreSQL - Postgres with backup/restore, high availability, and extensions Authorization - Define roles for different sets of users, and grant those roles support for specific actions on specific objects Control plane - Communicates with the data plane using SSH and manages resources Cloud console - A dashboard for users to use cloud services You can provide us with feedback, get help, or ask us to support your bare metal provider by sending us an email at [email protected]Managed ServicesAssistantResponses are generated using AI and may contain mistakes.",
    "word_count": 526
  },
  "summary": {
    "summary": "Ubicloud is an open-source, portable cloud alternative to proprietary services like AWS, Azure, and Google Cloud.  It offers Infrastructure-as-a-Service (IaaS) features at significantly reduced costs (3x-10x) by leveraging bare metal instances from providers such as Hetzner and Leaseweb.  Ubicloud prioritizes cost reduction, vendor lock-in avoidance, and user control over infrastructure, focusing initially on high-demand services like managed PostgreSQL and GitHub Actions runners.  Its open-source nature and AGPL v3 license allow for transparency and community contribution.  It provides core cloud services including compute, storage, networking, load balancing, and managed database solutions, all accessible through a user-friendly cloud console.  The platform aims to offer a subset of the most commonly used cloud services with a strong emphasis on cost-effectiveness and user control.\n\n\nKey Concepts: Open-source cloud, IaaS, Cost reduction, Vendor lock-in avoidance, Managed services (PostgreSQL, GitHub Actions runners), Bare metal instances,  Portability,  Security (encryption),  Control plane, Cloud console.\n",
    "key_concepts": [
      "Infrastructure-as-a-Service (IaaS)",
      "Cost Reduction",
      "Open Source",
      "Portability",
      "Vendor Lock-in",
      "Managed Services",
      "Managed PostgreSQL",
      "Virtual Machines (VMs)",
      "Security",
      "GitHub Actions Integration"
    ],
    "method": "ai_powered_gemini"
  }
}