{
  "scraped_content": {
    "url": "https://en.wikipedia.org/wiki/Thevar_Magan",
    "title": "Thevar Magan - Wikipedia",
    "sections": [
      {
        "title": "Thevar Magan - Wikipedia",
        "content": "Thevar Magan (/ðeɪvər/ or /θeɪvər/ transl. Son of Thevar)[a] is a 1992 Indian Tamil-language drama film directed by Bharathan, and written and produced by Kamal Haasan. It stars Sivaji Ganesan, Haasan, Revathi, Gautami and Nassar; with Kallapart Natarajan, Kaka Radhakrishnan, Sangili Murugan and Vadivelu in supporting roles. The film's story involves a respected village chieftain's son who wants to open a business but his father wants him to help the villagers. The script of Thevar Magan was completed in seven days; it was written using screenwriting software called Movie Magic. Haasan said The Godfather (1972) and the Kannada film Kaadu (1973) were inspirations for the film. P. C. Sreeram was the cinematographer and N. P. Satish edited the film, which was mostly made in Pollachi, with a few days' filming at Madras and Ooty. Thevar Magan was released on 25 October 1992 – Diwali day; it received critical acclaim and completed a 175-day run at the box office. It was chosen as India's entry for the Best Foreign Language Film for the 65th Academy Awards but was not nominated. Thevar Magan  won five National Film Awards, including Best Tamil Film, Best Supporting Actress for Revathi, and a Special Jury Award for Ganesan, which he declined. It was later remade in Hindi as Virasat (1997) and in Kannada as Thandege Thakka Maga (2006). ",
        "keywords": []
      },
      {
        "title": "Plot",
        "content": "Sakthivel returns home to his landlord father Periyasamy Thevar's village in rural Theni after completing his education in London. To his father's annoyance, he brings with him his westernised girlfriend Bhanumathi, hailing from Andhra Pradesh, to meet his family. Sakthi announces his plan to open a chain of restaurants in Madras and marry Banumathi, which saddens his father as he wanted his son to help local residents with his education. Periyasamy Thevar is a respected village chief whose younger half-brother Chinnasamy Thevar and nephew Mayan Thevar hold a grudge against him. Periyasamy's elder son Muthuvel, though the oldest in his generation, is a drunkard. The entire village suffers from this long-standing family feud. Mayan always tries to outdo Periyasamy Thevar as he believes Periyasamy to have poisoned Chinnasamy into paralysis. Sakthi, despite reservations about the barbaric behavior persisting in the village, spends time in the village with Bhanu. They find an old temple, built by his great grandfather, that has been closed off due to the feud between Periyasamy and Mayan regarding the first respect from temple. Sakthi insists on entering with the help of his friend and servant Isakki, who breaks open the temple. Mayan hears of this and a riot between the two village factions occurs. To quell the situation,  Periya Thevar contemplates apologising to his opponents. Sakthi feels he or Isakki should apologise instead. Sakthi goes off to drop Banu in the station and he sees the riot as he returns. When Sakthi reaches home and asks for Isakki, he learns Mayan's men have severed Isakki's left arm as punishment for opening the temple. To prevent further escalation of the situation, Sakthi, with his father's permission and with the help of his IAS friends in the government, legally opens the temple for all. Slighted by this, Mayan hires goons to break a dam protecting a part of the village that supports Periya thevar. The goons use explosives to damage the dam, flooding half of the village and resulting in numerous deaths, including infants. This saddens Sakthi, who spots the goon who placed the explosives and gives chase. After capturing the goon, Sakthi hands him over to the police. The goon does not mention Mayan's involvement in fear for his own family's safety. Seeing the plight of the villagers, Sakthi changes his mind and decides to stay back with maya thevar. Weeks later, Mayan uses his clout to force a poor villager to close a portion of his land, preventing the public from easily reaching the main road. Sakthi and his father invite them for talks at the village panchayat to resolve the standoff. In the panchayat, both sides repeatedly accuse the other. With no evidence, Mayan accuses Periya of orchestrating attacks on his brother's family and berates him. Disrespected and broken, Periya walks home and dies from a heart attack during sleep. Devastated and shocked about his father’s death and his disobedient behaviour, Sakthi takes over his father's duties as the village chieftain. The villagers express concern to Sakthi about having to daily circumnavigate the piece of land belonging to Mayan's side of the village, which causes a much longer travelling time. Sakthi reasons with the landowner Paramasivam to open it up for all villagers. Although understanding and willing, Paramasivam is Mayan's maternal uncle and is afraid of his nephew's backlash, especially because he has a daughter named Panchavarnam. Sakthi assuages his fear by arranging the marriage between Panchavarnam and a Engineer from madurai. Everybody involved happily agrees, and Paramasivam opens up the land. On the day of the wedding, however, the groom runs away, fearing Mayan. Paramasivam and Panchavarnam are distraught, and worried if someone marries his daughter, they will live in constant fear. With her father's permission, Sakthi marries Panchavarnam, although he still has feelings for Bhanu. Mayan tries to counter sakthi by getting Muthuvel drunk and obtaining his signature on ridiculous loan papers. The scheme is foiled in the last minute by Sakthi. Bhanu returns to meet Sakthi and learns about Sakthi's marriage. Although saddened, she understands the situation and leaves. Sakthi starts his new life with Panchavarnam. While Sakthi and Panchavaranam are returning from dropping off Banu at the station, a drive by attempt is made on their life, which they narrowly escape. This brings them closer, and they start their marital intimacy. Few weeks later, the HR&CE department plans the long pending temple celebrations and problem rises about the first respect. Muthuvel is ineligible as he is drunkard, and Mayan argues that he is next eldest heir of the builder of the temple. Sakthi gives up the first respect for peace, but Mayan rejects it. He publicly taunts sakthi that he will die soon and leaves. Weeks later, Sakthi is given the first respect, and the event starts. Sakthi's family learns that Panchavarnam is pregnant, and they are ecstatic. Mayan plants a bomb during the temple chariot festival, causing deaths on both sides of the village. Enraged, both factions go after Mayan and his family. Sakthi protects the innocent family and helps them escape from the villagers. Appreciative of Sakthi's efforts to protect them, they disclose Mayan's hiding place. Sakthi locates Mayan and asks him to surrender to the police lest the villagers kill him but Mayan refuses. Mayan blames Sakthi for his problems and tries to kill him. In the ensuing struggle, Sakthi accidentally beheads Mayan. The villagers offer to take the blame for Mayan's death, but Sakthi refuses and surrenders to the police. He asks the villagers to maintain peace, promote education for all and leaves for jail, leaving the control in hands of his sister-in-law. ",
        "keywords": []
      },
      {
        "title": "Development",
        "content": "In the 1980s, Muktha Srinivasan planned to direct a film based on The Godfather (1972) with Sivaji Ganesan and Kamal Haasan but the project was abandoned after Haasan's associate Ananthu felt it would be a Ganesan-focused film rather than a Haasan film.[8] Haasan later wrote a script, which eventually became Thevar Magan, in seven days, although he said he was challenged to write it in twelve.[9] The film was initially titled Nammavar but was later renamed to its final title.[10] Haasan also said it was inspired by The Godfather and the Kannada film Kaadu (1973).[11][9] Due to his lack of experience in directing, Haasan approached Bharathan to direct Thevar Magan.[12] According to Haasan, Thevar Magan is the first film that was written using a screenwriting software called \"Movie Magic\".[13] In 2016, Gangai Amaran said he was supposed to direct a film titled Adhi Veerapandian starring Haasan but Amaran's brother Ilaiyaraaja advised Haasan against accepting the film, feeling Amaran was \"not a good filmmaker\", and the film was shelved. Amaran said; \"Kamal took the story of Adhi Veerapandian and remade it as Thevar Magan\".[14] P. C. Sreeram was the cinematographer and N. P. Satish edited the film. Tirru worked as Sreeram's assistant and actor Tinku worked as assistant photographer.[15][16] ",
        "keywords": []
      },
      {
        "title": "Casting",
        "content": "According to Haasan, casting was done \"against everyone else's suggestion\".[9] In portraying Sakthi, Haasan wore colourful, buttoned-up shirts and jeans, and a medium-size beard and a mullet in the first half of the film. He grew a thick handlebar moustache and wore six yards (5.5 m) of village dhoti for the part of village head.[17] The unit had originally wanted to cast either Vijayakumar or S. S. Rajendran for the character Periya Thevar but Haasan approached Sivaji Ganesan, who completed his scenes within seven days.[18] Haasan persuaded Ganesan because it was his long-time desire to act in at least one film with him; Ganesan, who had retired from acting, agreed.[19] Haasan described Thevar Magan as a \"love story about Sivaji and me. I wanted to become him and he allowed me to become him\".[20] Meena was approached to play the character Panchavarnam; she acted for a few days but due to date issues, she was replaced by Revathi.[21][22] Gautami played Sakthi's initial lover Bhanu;[5] her voice was dubbed by K. R. Anuradha.[23] Vadivelu, who played Isakki, said; \"While shooting of Singaravelan, Kamal asked me to go to his Raaj Kamal office next morning and collect an advance payment for my role in his next film, Thevar Magan. But, I was not ready to wait until the next morning. So I went to his office the same evening after the shoot\" and received a cheque for ₹5,000.[24] Thalaivasal Vijay was cast as Sakthi's elder brother on Haasan's recommendation.[25] Salim Ghouse was the initial choice for the role of the antagonist Mayan Thevar which ultimately went to Nassar.[26] Neelima portrayed Mayan's daughter – it was her feature-film debut.[27] ",
        "keywords": []
      },
      {
        "title": "Filming",
        "content": "Thevar Magan was mostly filmed at Pollachi in 75 days, and for few days at Madras and Ooty.[18][28] Some scenes were filmed at a palatial bungalow situated at Singanallur.[29] Haasan has stated the scene in which a truck with a cargo of steel rods jutting out reverses into a car was initially written for Nayakan (1987) but could not be used there because producer Muktha Srinivasan would not let a car be damaged.[30] Writer Kalaignanam suggested the concept of one temple having two locks, which Haasan liked and added.[12][18] Some scenes were filmed at Mariamman Temple in Sulukkal, Pollachi.[31] Nassar filmed only seven scenes, of which two are major.[32] Sreeram revealed, \"after I heard the story from Bharatan, I wanted the whole film to have a rustic colour. So I took the extreme step of laying a whole road with coconut husk for a shot of one car going on the road in the beginning of the film\". There was a scene where the bund has been breached by some people and in order to have a \"wet, messy look\", Sreeram and crew for six days had to \"water the place before every shot\".[33] The film's end where Haasan gets into the train was shot at a railway station near Pollachi.[34] ",
        "keywords": []
      },
      {
        "title": "Themes and influences",
        "content": "According to Haasan, Thevar Magan was inspired by The Godfather and Kaadu;[11][9] journalist S. Shiva Kumar said he re-used The Godfather's \"crucial emotional core of a reluctant son ascending a throne full of thorns\".[35] Baradwaj Rangan said Haasan's screenplay \"uses small gestures to say a lot between the lines, without explaining everything in tiresome detail\", and that Bhanu is frequently shown boarding and alighting from trains, establishing her status as an outsider.[36] ",
        "keywords": []
      },
      {
        "title": "Soundtrack",
        "content": "Ilaiyaraaja composed the soundtrack of Thevar Magan and the lyrics were written by Vaali.[37] It was released under the label AVM Audio.[38] Embar Kannan performed the violin portions.[39] The soundtrack has eight tracks with two alternatives. Haasan's six-year-old daughter Shruti made her singing debut with this film, singing one version of \"Potri Paadadi Penne\";[40][41]  Haasan credited Gangai Amaran for the idea of \"Sandhu Pottu\", which was initially intended for Adhi Veerapandian.[42] \"Manamagale Manamagale\" is set in the Carnatic raga known as Shuddha Saveri,[43] \"Maasaru Ponne\" is set in Mayamalavagowla,[44] and \"Inji Iduppazhagi\" is set in Jaunpuri.[45] It was later remixed by Smita for her album Kalakkal.[46] The original song was re-used in Size Zero (2015).[47] ",
        "keywords": []
      },
      {
        "title": "Release",
        "content": "Thevar Magan was released on 25 October 1992, Diwali day.[48] The film was dubbed in Telugu as Kshatriya Putrudu.[49] The film became controversial for identifying the Thevar community with glorified violence,[50][51] and faced competition from other Diwali releases Pandian, Rasukutty, Senthamizh Paattu,[52] Kaviya Thalaivan, Thirumathi Palanisamy, Thai Mozhi and Mangala Nayagan.[53] Despite these, Thevar Magan was commercially successful and ran for 175 days, becoming a silver jubilee film.[54] Dilip Kumar attended the film's silver-jubilee celebration.[55][56] No print of Thevar Magan has survived but the film is available on home video.[57] ",
        "keywords": []
      },
      {
        "title": "Reception",
        "content": "Thevar Magan received critical acclaim.[58] On 25 October 1992, The Indian Express said; \"The formidable combination of Kamal Haasan and Sivaji Ganesan, the directorial talent of Bharathan, excellent cinematography of P. C. Sriram and music by the maestro [Ilaiyaraaja], have all gone into producing Thevar Magan\".[59] The Tamil magazine Ananda Vikatan in its review dated 8 November 1992 appreciated the film and said its naturalism is greatly enhanced by the giving of equal opportunity to all actors in the film. It rated the film 60 out of 100.[60] K. Vijiyan of New Sunday Times wrote \"Devar Magan proved a satisfying experience at the cinema and well worth the wait\".[5] C. R. K. of Kalki praised the film for perfectly concentrating on character design, natural dialogues and the screenplay that carries these elements.[61] ",
        "keywords": []
      },
      {
        "title": "Accolades",
        "content": "Thevar Magan was chosen as India's entry for the Best Foreign Language Film for the 65th Academy Awards but was not nominated.[62] The film was screened at the Toronto International Film Festival in 1994.[63] Ilaiyaraaja was a strong contender for the National Film Award for Best Music Direction, which he lost to A. R. Rahman for Roja; the award was tied with eight votes each for Ilaiyaraaja and Rahman before the chairman of the jury Balu Mahendra voted in favour of Rahman.[64] Ganesan had been awarded the Special Jury Award – Actor in the same ceremony but he refused to accept the award.[65][66] Haasan claimed he convinced Ganesan not to accept it.[67] ",
        "keywords": []
      },
      {
        "title": "Remakes",
        "content": "Haasan initially planned to remake Thevar Magan in Hindi with Dilip Kumar in Ganesan's role but according to Haasan, Kumar found the theme \"too violent\" and refused the offer.[74] Priyadarshan directed the Hindi remake Virasat (1997).[75][76] S. Mahendar remade Thevar Magan in Kannada as Thandege Thakka Maga (2006).[77] ",
        "keywords": []
      },
      {
        "title": "Legacy",
        "content": "Thevar Magan attained cult status in Tamil cinema.[78][79] Rajan Krishnan, a scholar in film studies, said; \"it was Kamal Hassan who brought that sickle bearing genre\", and that \"Thevar Magan ... inaugurated the era of the south being represented as primarily a sickle bearing space\".[80][81] Stalin Rajangam, who has extensively written on the caste component and narrative structures of Tamil films, said; \"Thevar Magan was first of its kind with stronger idioms of caste and glorification of caste-based practices\".[80] Tamil writer S. Ramakrishnan said Thevar Magan captured \"the very essence of the south Tamil Nadu's rural culture\".[82] Vadivelu called the film a \"turning point\" in his career.[83] Directors N. Lingusamy,[84] Mysskin,[85] Gautham Vasudev Menon,[86] and S. J. Suryah called Thevar Magan one of their favourite films.[87] Gauthami also listed it as her one of her favourite films.[88] Sify, in its review of Sandakozhi (2005), compared Rajkiran's character with Ganesan's character in Thevar Magan.[89] The July 2010 edition of magazine South Scope included Haasan's performance in 'Thevar Magan in its list of \"Kamal's best performances\".[17] Silverscreen in its review of Vetrivel (2016) called the film \"pretty much an unsophisticated copy of Thevar Magan\".[90] In 2013, The Hindu listed the song \"Potri Paadadi\" among lyricist Vaali's songs in the list \"Best of Vaali: From 1964 – 2013\".[91] Rediff listed the same song alongside \"Madhavi Pon Mayilaal\" from Iru Malargal (1967) and \"Andha Naal Gnabagam\" from Uyarndha Manithan (1968).[92] On Haasan's birthday, 7 November 2015, Latha Srinivasan of Daily News and Analysis considered Thevar Magan to be one of the \"films you must watch to grasp the breadth of Kamal Haasan's repertoire\".[93] ",
        "keywords": []
      }
    ],
    "full_text": "Thevar Magan - Wikipedia Jump to content From Wikipedia, the free encyclopedia 1992 film by directed by Bharathan Thevar MaganTheatrical release posterDirected byBharathanWritten byKamal HaasanProduced byKamal HaasanStarring Sivaji Ganesan Kamal Haasan Revathi Gautami Nassar CinematographyP. C. SreeramEdited byN. P. SatishMusic byIlaiyaraajaProductioncompanyRaaj Kamal Films InternationalRelease date 25 October 1992 (1992-10-25) Running time158 minutes[1]CountryIndiaLanguageTamil Thevar Magan (/ðeɪvər/ or /θeɪvər/ transl. Son of Thevar)[a] is a 1992 Indian Tamil-language drama film directed by Bharathan, and written and produced by Kamal Haasan. It stars Sivaji Ganesan, Haasan, Revathi, Gautami and Nassar; with Kallapart Natarajan, Kaka Radhakrishnan, Sangili Murugan and Vadivelu in supporting roles. The film's story involves a respected village chieftain's son who wants to open a business but his father wants him to help the villagers. The script of Thevar Magan was completed in seven days; it was written using screenwriting software called Movie Magic. Haasan said The Godfather (1972) and the Kannada film Kaadu (1973) were inspirations for the film. P. C. Sreeram was the cinematographer and N. P. Satish edited the film, which was mostly made in Pollachi, with a few days' filming at Madras and Ooty. Thevar Magan was released on 25 October 1992 – Diwali day; it received critical acclaim and completed a 175-day run at the box office. It was chosen as India's entry for the Best Foreign Language Film for the 65th Academy Awards but was not nominated. Thevar Magan won five National Film Awards, including Best Tamil Film, Best Supporting Actress for Revathi, and a Special Jury Award for Ganesan, which he declined. It was later remade in Hindi as Virasat (1997) and in Kannada as Thandege Thakka Maga (2006). Plot[edit] Sakthivel returns home to his landlord father Periyasamy Thevar's village in rural Theni after completing his education in London. To his father's annoyance, he brings with him his westernised girlfriend Bhanumathi, hailing from Andhra Pradesh, to meet his family. Sakthi announces his plan to open a chain of restaurants in Madras and marry Banumathi, which saddens his father as he wanted his son to help local residents with his education. Periyasamy Thevar is a respected village chief whose younger half-brother Chinnasamy Thevar and nephew Mayan Thevar hold a grudge against him. Periyasamy's elder son Muthuvel, though the oldest in his generation, is a drunkard. The entire village suffers from this long-standing family feud. Mayan always tries to outdo Periyasamy Thevar as he believes Periyasamy to have poisoned Chinnasamy into paralysis. Sakthi, despite reservations about the barbaric behavior persisting in the village, spends time in the village with Bhanu. They find an old temple, built by his great grandfather, that has been closed off due to the feud between Periyasamy and Mayan regarding the first respect from temple. Sakthi insists on entering with the help of his friend and servant Isakki, who breaks open the temple. Mayan hears of this and a riot between the two village factions occurs. To quell the situation, Periya Thevar contemplates apologising to his opponents. Sakthi feels he or Isakki should apologise instead. Sakthi goes off to drop Banu in the station and he sees the riot as he returns. When Sakthi reaches home and asks for Isakki, he learns Mayan's men have severed Isakki's left arm as punishment for opening the temple. To prevent further escalation of the situation, Sakthi, with his father's permission and with the help of his IAS friends in the government, legally opens the temple for all. Slighted by this, Mayan hires goons to break a dam protecting a part of the village that supports Periya thevar. The goons use explosives to damage the dam, flooding half of the village and resulting in numerous deaths, including infants. This saddens Sakthi, who spots the goon who placed the explosives and gives chase. After capturing the goon, Sakthi hands him over to the police. The goon does not mention Mayan's involvement in fear for his own family's safety. Seeing the plight of the villagers, Sakthi changes his mind and decides to stay back with maya thevar. Weeks later, Mayan uses his clout to force a poor villager to close a portion of his land, preventing the public from easily reaching the main road. Sakthi and his father invite them for talks at the village panchayat to resolve the standoff. In the panchayat, both sides repeatedly accuse the other. With no evidence, Mayan accuses Periya of orchestrating attacks on his brother's family and berates him. Disrespected and broken, Periya walks home and dies from a heart attack during sleep. Devastated and shocked about his father’s death and his disobedient behaviour, Sakthi takes over his father's duties as the village chieftain. The villagers express concern to Sakthi about having to daily circumnavigate the piece of land belonging to Mayan's side of the village, which causes a much longer travelling time. Sakthi reasons with the landowner Paramasivam to open it up for all villagers. Although understanding and willing, Paramasivam is Mayan's maternal uncle and is afraid of his nephew's backlash, especially because he has a daughter named Panchavarnam. Sakthi assuages his fear by arranging the marriage between Panchavarnam and a Engineer from madurai. Everybody involved happily agrees, and Paramasivam opens up the land. On the day of the wedding, however, the groom runs away, fearing Mayan. Paramasivam and Panchavarnam are distraught, and worried if someone marries his daughter, they will live in constant fear. With her father's permission, Sakthi marries Panchavarnam, although he still has feelings for Bhanu. Mayan tries to counter sakthi by getting Muthuvel drunk and obtaining his signature on ridiculous loan papers. The scheme is foiled in the last minute by Sakthi. Bhanu returns to meet Sakthi and learns about Sakthi's marriage. Although saddened, she understands the situation and leaves. Sakthi starts his new life with Panchavarnam. While Sakthi and Panchavaranam are returning from dropping off Banu at the station, a drive by attempt is made on their life, which they narrowly escape. This brings them closer, and they start their marital intimacy. Few weeks later, the HR&CE department plans the long pending temple celebrations and problem rises about the first respect. Muthuvel is ineligible as he is drunkard, and Mayan argues that he is next eldest heir of the builder of the temple. Sakthi gives up the first respect for peace, but Mayan rejects it. He publicly taunts sakthi that he will die soon and leaves. Weeks later, Sakthi is given the first respect, and the event starts. Sakthi's family learns that Panchavarnam is pregnant, and they are ecstatic. Mayan plants a bomb during the temple chariot festival, causing deaths on both sides of the village. Enraged, both factions go after Mayan and his family. Sakthi protects the innocent family and helps them escape from the villagers. Appreciative of Sakthi's efforts to protect them, they disclose Mayan's hiding place. Sakthi locates Mayan and asks him to surrender to the police lest the villagers kill him but Mayan refuses. Mayan blames Sakthi for his problems and tries to kill him. In the ensuing struggle, Sakthi accidentally beheads Mayan. The villagers offer to take the blame for Mayan's death, but Sakthi refuses and surrenders to the police. He asks the villagers to maintain peace, promote education for all and leaves for jail, leaving the control in hands of his sister-in-law. Cast[edit] Sivaji Ganesan as Periyasamy Thevar Kamal Haasan as Sakthivel Thevar Revathi as Panchavarnam Gautami as Bhanumathi Nassar as Mayan Thevar Kaka Radhakrishnan as Chinnasamy Thevar Vadivelu as Isakki Kallapart Natarajan as Paramasivam[3] Sangili Murugan as Subbiah[3] Thalaivasal Vijay as Muthuvel Thevar S. N. Lakshmi as Kannatha, Mayan Thevar's mother[4] Gandhimathi as Maragatham[3] Renuka as Lakshmi, Sakthivel's sister-in-law[5] Madhan Bob as Lawyer Kesavan[6] Ajay Rathnam as S. Maruthupandi[3] Neelima Rani as Meena, Mayan Thevar's daughter[7] Production[edit] Development[edit] In the 1980s, Muktha Srinivasan planned to direct a film based on The Godfather (1972) with Sivaji Ganesan and Kamal Haasan but the project was abandoned after Haasan's associate Ananthu felt it would be a Ganesan-focused film rather than a Haasan film.[8] Haasan later wrote a script, which eventually became Thevar Magan, in seven days, although he said he was challenged to write it in twelve.[9] The film was initially titled Nammavar but was later renamed to its final title.[10] Haasan also said it was inspired by The Godfather and the Kannada film Kaadu (1973).[11][9] Due to his lack of experience in directing, Haasan approached Bharathan to direct Thevar Magan.[12] According to Haasan, Thevar Magan is the first film that was written using a screenwriting software called \"Movie Magic\".[13] In 2016, Gangai Amaran said he was supposed to direct a film titled Adhi Veerapandian starring Haasan but Amaran's brother Ilaiyaraaja advised Haasan against accepting the film, feeling Amaran was \"not a good filmmaker\", and the film was shelved. Amaran said; \"Kamal took the story of Adhi Veerapandian and remade it as Thevar Magan\".[14] P. C. Sreeram was the cinematographer and N. P. Satish edited the film. Tirru worked as Sreeram's assistant and actor Tinku worked as assistant photographer.[15][16] Casting[edit] According to Haasan, casting was done \"against everyone else's suggestion\".[9] In portraying Sakthi, Haasan wore colourful, buttoned-up shirts and jeans, and a medium-size beard and a mullet in the first half of the film. He grew a thick handlebar moustache and wore six yards (5.5 m) of village dhoti for the part of village head.[17] The unit had originally wanted to cast either Vijayakumar or S. S. Rajendran for the character Periya Thevar but Haasan approached Sivaji Ganesan, who completed his scenes within seven days.[18] Haasan persuaded Ganesan because it was his long-time desire to act in at least one film with him; Ganesan, who had retired from acting, agreed.[19] Haasan described Thevar Magan as a \"love story about Sivaji and me. I wanted to become him and he allowed me to become him\".[20] Meena was approached to play the character Panchavarnam; she acted for a few days but due to date issues, she was replaced by Revathi.[21][22] Gautami played Sakthi's initial lover Bhanu;[5] her voice was dubbed by K. R. Anuradha.[23] Vadivelu, who played Isakki, said; \"While shooting of Singaravelan, Kamal asked me to go to his Raaj Kamal office next morning and collect an advance payment for my role in his next film, Thevar Magan. But, I was not ready to wait until the next morning. So I went to his office the same evening after the shoot\" and received a cheque for ₹5,000.[24] Thalaivasal Vijay was cast as Sakthi's elder brother on Haasan's recommendation.[25] Salim Ghouse was the initial choice for the role of the antagonist Mayan Thevar which ultimately went to Nassar.[26] Neelima portrayed Mayan's daughter – it was her feature-film debut.[27] Filming[edit] Thevar Magan was mostly filmed at Pollachi in 75 days, and for few days at Madras and Ooty.[18][28] Some scenes were filmed at a palatial bungalow situated at Singanallur.[29] Haasan has stated the scene in which a truck with a cargo of steel rods jutting out reverses into a car was initially written for Nayakan (1987) but could not be used there because producer Muktha Srinivasan would not let a car be damaged.[30] Writer Kalaignanam suggested the concept of one temple having two locks, which Haasan liked and added.[12][18] Some scenes were filmed at Mariamman Temple in Sulukkal, Pollachi.[31] Nassar filmed only seven scenes, of which two are major.[32] Sreeram revealed, \"after I heard the story from Bharatan, I wanted the whole film to have a rustic colour. So I took the extreme step of laying a whole road with coconut husk for a shot of one car going on the road in the beginning of the film\". There was a scene where the bund has been breached by some people and in order to have a \"wet, messy look\", Sreeram and crew for six days had to \"water the place before every shot\".[33] The film's end where Haasan gets into the train was shot at a railway station near Pollachi.[34] Themes and influences[edit] According to Haasan, Thevar Magan was inspired by The Godfather and Kaadu;[11][9] journalist S. Shiva Kumar said he re-used The Godfather's \"crucial emotional core of a reluctant son ascending a throne full of thorns\".[35] Baradwaj Rangan said Haasan's screenplay \"uses small gestures to say a lot between the lines, without explaining everything in tiresome detail\", and that Bhanu is frequently shown boarding and alighting from trains, establishing her status as an outsider.[36] Soundtrack[edit] Ilaiyaraaja composed the soundtrack of Thevar Magan and the lyrics were written by Vaali.[37] It was released under the label AVM Audio.[38] Embar Kannan performed the violin portions.[39] The soundtrack has eight tracks with two alternatives. Haasan's six-year-old daughter Shruti made her singing debut with this film, singing one version of \"Potri Paadadi Penne\";[40][41] Haasan credited Gangai Amaran for the idea of \"Sandhu Pottu\", which was initially intended for Adhi Veerapandian.[42] \"Manamagale Manamagale\" is set in the Carnatic raga known as Shuddha Saveri,[43] \"Maasaru Ponne\" is set in Mayamalavagowla,[44] and \"Inji Iduppazhagi\" is set in Jaunpuri.[45] It was later remixed by Smita for her album Kalakkal.[46] The original song was re-used in Size Zero (2015).[47] Track listingNo.TitleSinger(s)Length1.\"Potri Paadadi Penne\" (Version 1)T. K. S. Kalaivanan, Mano4:572.\"Potri Paadadi Penne\" (Version 2)Sivaji Ganesan, Shruti Haasan1:263.\"Sandhu Pottu\"S. P. Balasubrahmanyam, Kamal Haasan5:104.\"Vaanam Thottu Pona\"S. P. Balasubrahmanyam2:265.\"Vettaruva Thangi\"S. P. Balasubrahmanyam2:386.\"Ada Puthiyathu Piranthadhu\"Malaysia Vasudevan4:437.\"Inji Idupazhaga\" (Solo)S. Janaki2:168.\"Inji Idupazhagi\" (Duet)S. Janaki, Kamal Haasan, Minmini3:299.\"Manamagale Manamagale\"Swarnalatha, Minmini, Sindhuja2:1610.\"Masaru Ponnae Varuga\"Minmini, Swarnalatha3:12Total length:32:33 Release[edit] Thevar Magan was released on 25 October 1992, Diwali day.[48] The film was dubbed in Telugu as Kshatriya Putrudu.[49] The film became controversial for identifying the Thevar community with glorified violence,[50][51] and faced competition from other Diwali releases Pandian, Rasukutty, Senthamizh Paattu,[52] Kaviya Thalaivan, Thirumathi Palanisamy, Thai Mozhi and Mangala Nayagan.[53] Despite these, Thevar Magan was commercially successful and ran for 175 days, becoming a silver jubilee film.[54] Dilip Kumar attended the film's silver-jubilee celebration.[55][56] No print of Thevar Magan has survived but the film is available on home video.[57] Reception[edit] Thevar Magan received critical acclaim.[58] On 25 October 1992, The Indian Express said; \"The formidable combination of Kamal Haasan and Sivaji Ganesan, the directorial talent of Bharathan, excellent cinematography of P. C. Sriram and music by the maestro [Ilaiyaraaja], have all gone into producing Thevar Magan\".[59] The Tamil magazine Ananda Vikatan in its review dated 8 November 1992 appreciated the film and said its naturalism is greatly enhanced by the giving of equal opportunity to all actors in the film. It rated the film 60 out of 100.[60] K. Vijiyan of New Sunday Times wrote \"Devar Magan proved a satisfying experience at the cinema and well worth the wait\".[5] C. R. K. of Kalki praised the film for perfectly concentrating on character design, natural dialogues and the screenplay that carries these elements.[61] Accolades[edit] Thevar Magan was chosen as India's entry for the Best Foreign Language Film for the 65th Academy Awards but was not nominated.[62] The film was screened at the Toronto International Film Festival in 1994.[63] Ilaiyaraaja was a strong contender for the National Film Award for Best Music Direction, which he lost to A. R. Rahman for Roja; the award was tied with eight votes each for Ilaiyaraaja and Rahman before the chairman of the jury Balu Mahendra voted in favour of Rahman.[64] Ganesan had been awarded the Special Jury Award – Actor in the same ceremony but he refused to accept the award.[65][66] Haasan claimed he convinced Ganesan not to accept it.[67] Award Date of ceremony[b] Category Nominee(s) Result Ref. National Film Awards 5 May 1993 Best Feature Film in Tamil Kamal Haasan, Bharathan Won [68] Best Supporting Actress Revathi Won Best Female Playback Singer S. Janaki Won Best Audiography N. Pandu Rangan Won Special Jury Award – Actor Sivaji Ganesan (declined) Won Tamil Nadu State Film Awards c. 1994 Tamil Nadu State Film Award for Best Film-(Second Prize) Kamal Haasan Won [18][69] Best Actor Kamal Haasan Won Best Choreographer Raghuram Won Filmfare Awards South 13 October 1993 Best Actor – Tamil Kamal Haasan Won [70][71] Best Actress – Tamil Revathi Won Cinema Express Awards 14 June 1993 Best Film Kamal Haasan Won [72] Best Actress Revathi Won Film Fans Association – Best Actress Revathi Won [73] Remakes[edit] Haasan initially planned to remake Thevar Magan in Hindi with Dilip Kumar in Ganesan's role but according to Haasan, Kumar found the theme \"too violent\" and refused the offer.[74] Priyadarshan directed the Hindi remake Virasat (1997).[75][76] S. Mahendar remade Thevar Magan in Kannada as Thandege Thakka Maga (2006).[77] Legacy[edit] Thevar Magan attained cult status in Tamil cinema.[78][79] Rajan Krishnan, a scholar in film studies, said; \"it was Kamal Hassan who brought that sickle bearing genre\", and that \"Thevar Magan ... inaugurated the era of the south being represented as primarily a sickle bearing space\".[80][81] Stalin Rajangam, who has extensively written on the caste component and narrative structures of Tamil films, said; \"Thevar Magan was first of its kind with stronger idioms of caste and glorification of caste-based practices\".[80] Tamil writer S. Ramakrishnan said Thevar Magan captured \"the very essence of the south Tamil Nadu's rural culture\".[82] Vadivelu called the film a \"turning point\" in his career.[83] Directors N. Lingusamy,[84] Mysskin,[85] Gautham Vasudev Menon,[86] and S. J. Suryah called Thevar Magan one of their favourite films.[87] Gauthami also listed it as her one of her favourite films.[88] Sify, in its review of Sandakozhi (2005), compared Rajkiran's character with Ganesan's character in Thevar Magan.[89] The July 2010 edition of magazine South Scope included Haasan's performance in 'Thevar Magan in its list of \"Kamal's best performances\".[17] Silverscreen in its review of Vetrivel (2016) called the film \"pretty much an unsophisticated copy of Thevar Magan\".[90] In 2013, The Hindu listed the song \"Potri Paadadi\" among lyricist Vaali's songs in the list \"Best of Vaali: From 1964 – 2013\".[91] Rediff listed the same song alongside \"Madhavi Pon Mayilaal\" from Iru Malargal (1967) and \"Andha Naal Gnabagam\" from Uyarndha Manithan (1968).[92] On Haasan's birthday, 7 November 2015, Latha Srinivasan of Daily News and Analysis considered Thevar Magan to be one of the \"films you must watch to grasp the breadth of Kamal Haasan's repertoire\".[93] See also[edit] List of submissions to the 65th Academy Awards for Best Foreign Language Film List of Indian submissions for the Academy Award for Best Foreign Language Film Notes[edit] ^ The Mukkulathor people, who are also collectively known as Thevar, are native to the central and southern districts of Tamil Nadu, According to R. Muthulakshmi, Thevar literally means \"celestial beings or divine-natured people\".[2] ^ Date is linked to the article about the awards held that year, wherever possible. References[edit] ^ Rajadhyaksha & Willemen 1998, p. 511. ^ Muthulakshmi 1997, pp. 11–13. ^ a b c d \"Thevar Magan (1992) – Bharathan | Cast & Crew\". AllMovie. Archived from the original on 4 July 2020. Retrieved 4 July 2020. ^ \"Courage goaded her on ...\" The Hindu. 28 May 2010. Archived from the original on 5 July 2020. Retrieved 3 July 2020. ^ a b c Vijiyan, K. (9 November 1992). \"Sivaji and Kamal make this movie worth waiting for\". New Sunday Times. p. 29. Retrieved 17 September 2020 – via Google News Archive. ^ \"The smile, a gift from my dad: Madhan Bob\". Iflicks. 12 November 2018. Archived from the original on 3 July 2020. Retrieved 4 July 2020. ^ ஆனந்தராஜ், கு. (14 June 2017). \"கமல் சார் கழுத்துல அருவாளை வெச்சப்போ...!″ நீலிமா ராணி ஃப்ளாஷ்பேக்\". Ananda Vikatan (in Tamil). Archived from the original on 4 July 2020. Retrieved 4 July 2020. ^ Srinivasan, Muktha V. (28 October 2012). \"Living in past glory\". The Hindu. Archived from the original on 17 October 2015. Retrieved 23 October 2015. ^ a b c d Haasan, Kamal. \"Bollywood blockbuster to Kollywood classic: Kamal Haasan picks his 70 favourite movies\". Hindustan Times. Archived from the original on 16 September 2017. Retrieved 25 September 2017. ^ \"Kamal's new ventures\". The Hindu. 11 March 2004. Archived from the original on 25 September 2017. Retrieved 25 September 2017. ^ a b \"Was \"Nayakan\" inspired by 'The Godfather'?\". Daily News & Analysis. 16 November 2013. Archived from the original on 25 September 2017. Retrieved 25 September 2017. ^ a b \"காலம் கடந்து நிற்கும் 'தேவர் மகன்' – வெள்ளி விழா ஆண்டு சிறப்பு கட்டுரை\". NDTV (in Tamil). 25 October 2017. Archived from the original on 4 July 2020. Retrieved 6 August 2020. ^ Kamath, Sudhish (28 May 2009). \"Writing for celluloid\". The Hindu. Archived from the original on 3 December 2013. Retrieved 12 September 2015. ^ \"Gangai Amaren lashes out at Ilaiyaraaja and Kamal Haasan\". Deccan Chronicle. 23 June 2016. Archived from the original on 23 June 2016. Retrieved 20 July 2016. ^ \"Realistic frames\". The Hindu. 6 July 2007. Archived from the original on 26 February 2018. Retrieved 3 July 2020. ^ \"A \"Master\" returns\". The Hindu. 29 November 2007. Archived from the original on 5 July 2020. Retrieved 3 July 2020. ^ a b Southscope 2010, p. 52. ^ a b c d Dhananjayan 2014, p. 325. ^ \"Unique memorial for Sivaji Ganesan\". The Times of India. PTI. 26 October 2002. Archived from the original on 6 May 2022. Retrieved 6 May 2022. ^ Natarajan, Nikhila (28 March 2016). \"'I wrote Thevar Magan, that movie is a Sivaji-Kamal love story': The best of Kamal Haasan's 90 minutes with die-hard fans in New York\". Firstpost. Archived from the original on 5 May 2021. Retrieved 15 September 2021. ^ \"கதையில் வந்த சந்தேகம், மீனாவுக்கு பதில் ரேவதி: 'தேவர் மகன்' ரகசியங்கள்\". Hindu Tamil Thisai (in Tamil). 11 May 2020. Archived from the original on 6 June 2020. Retrieved 2 June 2022. ^ Rangarajan, Malathi (14 October 2005). \"Diva in the drawing room\". The Hindu. Archived from the original on 5 July 2020. Retrieved 3 July 2020. ^ Lakshmi, K. (11 January 2009). \"They act in front of the mike at work\". The Hindu. Archived from the original on 17 October 2019. Retrieved 3 July 2020. ^ \"When Vadivelu's overacting caught Sivaji Ganesan and Kamal Haasan off-guard\". The Indian Express. 19 November 2019. Archived from the original on 5 July 2020. Retrieved 5 July 2020. ^ Rangarajan, Malathi (18 January 2008). \"Happy times of a veteran\". The Hindu. Archived from the original on 3 July 2020. Retrieved 3 July 2020. ^ பாரதிராஜா, மை. (29 April 2022). \"\"தேவர் மகன் படத்தில் நாசர் ரோல் சலீம் கவுஸ்தான் நடிக்கவேண்டியது\" - நினைவுகள் பகிரும் விஜய் பாலாஜி\". Ananda Vikatan (in Tamil). Archived from the original on 27 May 2022. Retrieved 3 November 2022. ^ Kumar, S. R. Ashok (7 January 2010). \"My First Break: Neelima\". The Hindu. Archived from the original on 5 July 2020. Retrieved 5 July 2020. ^ Jeshi, K.; Rao, Subha K. (6 June 2014). \"Creating a scene\". The Hindu. Archived from the original on 27 June 2014. Retrieved 12 September 2015. ^ Vanavarayar, Shankar (30 September 2006). \"A perfect backdrop\". The Hindu. Archived from the original on 3 July 2020. Retrieved 3 July 2020. ^ Haasan, Kamal (20 October 2012). \"'Of course Velu Nayakan doesn't dance'\". The Hindu. Archived from the original on 18 June 2013. Retrieved 12 September 2015. ^ \"Sulakkal Mariamman temple\". Where Was It Shot. Archived from the original on 22 December 2015. Retrieved 18 December 2015. ^ \"Interview with Actor Naser\". Tamil Movie Cafe. Archived from the original on 2 July 2001. Retrieved 17 December 2020. ^ \"Through the eyes of P C Sreeram\". Rediff.com. 20 July 2004. slide 3. Archived from the original on 29 December 2023. Retrieved 30 December 2023. ^ @kamalhaasandatabank (25 October 2016). \"#24YearsOfThevarmagan First man @ikamalhaasan to use software Movie Magic for writing screen play during 1992, always stands ahead of times\" (Tweet). Retrieved 5 July 2024 – via Twitter. ^ Shiva Kumar, S. (6 March 2014). \"The age of remakes\". The Hindu. Archived from the original on 27 November 2014. Retrieved 26 November 2016. ^ \"Watch: Film critic Baradwaj Rangan on why Kamal's \"Thevar Magan\" remains a classic 25 yrs later\". The News Minute. 19 October 2017. Archived from the original on 28 July 2020. Retrieved 28 July 2020. ^ \"Devar Magan (1992)\". Raaga.com. Archived from the original on 25 August 2015. Retrieved 14 October 2015. ^ \"Devar Mahan\". AV Digital. Archived from the original on 18 October 2020. Retrieved 18 October 2020. ^ Krupa, Lakshmi (24 March 2013). \"From kutcheris to recording studios\". The Hindu. Archived from the original on 10 October 2015. Retrieved 12 September 2015. ^ Ittyipe, Minu (7 March 2008). \"It's the genes at play\". India Today. Archived from the original on 16 August 2015. Retrieved 19 October 2015. ^ Kumar, Pradeep (1 July 2018). \"Kamal Haasan trolled over daughter Shruti's \"I am Iyengar\" video; actor asked to start reform at home\". The Times of India. Archived from the original on 17 December 2020. Retrieved 17 December 2020. ^ \"\"Kamal and Illayaraja let me down\" - Gangai Amaran\". IndiaGlitz. 21 June 2016. Archived from the original on 6 June 2022. Retrieved 6 June 2022. ^ Srinivasan, Anil (1 June 2013). \"The King and I\". The Hindu. Archived from the original on 12 September 2013. Retrieved 12 September 2015. ^ Mani, Charulatha (11 November 2011). \"A Raga's Journey – The magic of Mayamalavagowla\". The Hindu. Archived from the original on 21 November 2014. Retrieved 12 September 2015. ^ \"Jaunty Jonpuri\". The Hindu. 12 May 2012. Archived from the original on 3 July 2020. Retrieved 3 July 2020. ^ Frederick, Prince (29 December 2004). \"'Kalakal' remix\". The Hindu. Archived from the original on 22 October 2017. Retrieved 12 September 2015. ^ \"Kamal and Revathy to appear in Arya-Anushka starrer \"Inji Idupazhagi\"\". IndiaGlitz. 1 September 2015. Archived from the original on 5 October 2015. Retrieved 29 September 2015. ^ நவநீதகிருஷ்ணன், பா ஸ்டாலின் (25 October 2022). \"ABP Nadu Exclusive: இந்த நாள் மறக்கவே கூடாது... 30 ஆண்டுகளுக்கு முன் ஒரே நாளில் மோதிய டாப் ஹீரோக்கள்!\". ABP Nadu (in Tamil). Archived from the original on 25 October 2022. Retrieved 20 December 2022. ^ \"'Suryavamsam' to \"Singam\" - five Tamil films that were remade in Bollywood\". The Times of India. 3 February 2020. Archived from the original on 25 July 2020. Retrieved 6 June 2022. ^ Nambath, Suresh (28 December 2003). \"The politics of art\". The Hindu. Archived from the original on 5 July 2020. Retrieved 4 July 2020. ^ \"Kamal Haasan and controversy\". The Hindu. 29 January 2013. Archived from the original on 29 June 2013. Retrieved 4 July 2020. ^ Prasad, Ayyappa (30 October 1992). \"Of film gods, devotees and the rage\". The Indian Express. p. 7. Retrieved 17 September 2020 – via Google News Archive. ^ Prasad, Ayyappa (23 October 1992). \"Thrilling but lacks punch\". The Indian Express. p. 7. Retrieved 13 September 2019 – via Google News Archive. ^ செல்வராஜ், என். (20 March 2017). \"வெள்ளி விழா கண்ட தமிழ் திரைப்படங்கள் – திண்ணை\". Thinnai (in Tamil). Archived from the original on 29 March 2017. Retrieved 25 January 2020. ^ Kumar, Dilip (2014). Dilip Kumar: The Substance and the Shadow. Hay House. ISBN 978-9381398968. I also recall his presence at the distribution of the trophies on the silver jubilee run of Thevar Magan. ^ \"Romancing to Rajaa's tune\". The Hans India. 13 December 2015. Archived from the original on 25 January 2020. Retrieved 25 January 2020. ^ \"Lenin Award for Archivist PK Nair\". The New Indian Express. 17 August 2015. Archived from the original on 15 November 2015. Retrieved 25 October 2015. ^ Roychoudhury, Shibaji (4 December 2018). \"Kamal Haasan does it again! Announces his retirement from acting for the third time\". Times Now. Archived from the original on 14 April 2019. Retrieved 25 January 2020. ^ Prasad, Ayyappa (25 October 1992). \"Thevars, troubles and truce\". The Indian Express. p. 7. Retrieved 4 December 2020 – via Google News Archive. ^ \"சினிமா விமர்சனம்: தேவர் மகன்\" [Movie Review: Thevar Magan]. Ananda Vikatan (in Tamil). 8 November 1992. ^ சி. ஆர். கே. (8 November 1992). \"தேவர் மகன்\". Kalki (in Tamil). pp. 12–13. Archived from the original on 3 February 2023. Retrieved 3 February 2023. ^ Marx, Andy (2 December 1992). \"Foreign Oscar entries submitted\". Variety. Archived from the original on 23 September 2015. Retrieved 20 September 2015. ^ Jain, Ajit (16 September 1994). \"27 Indian Films in Toronto Cinema Gala\". India Abroad. Archived from the original on 25 February 2016. Retrieved 1 June 2012. ^ Mathai 2009, pp. 99–100. ^ Baskaran 2015, p. 80. ^ Jeyaraj, D. B. S. (7 August 2014). \"Sivaji Ganesan: Tamil cinema's versatile actor par excellence\". DBSJeyaraj.com. Archived from the original on 8 August 2014. Retrieved 3 July 2020. ^ \"Kamal Haasan reveals he convinced Sivaji Ganesan to reject National Award for Thevar Magan. Here's why\". The Indian Express. 10 August 2022. Archived from the original on 26 October 2022. Retrieved 26 October 2022. ^ \"40th National Film Festival\" (PDF). Directorate of Film Festivals. Archived from the original (PDF) on 9 March 2016. Retrieved 2 March 2012. ^ \"Film city to be ready soon: Jaya\". The Indian Express. 19 January 1994. p. 3. Retrieved 18 January 2021 – via Google News Archive. ^ Dave, Kajol (20 July 2013). \"Filmfare trivia: Kamal Haasan\". Filmfare. Archived from the original on 24 July 2013. Retrieved 5 July 2020. ^ Data India. Press Institute of India. 1993. p. 864. Archived from the original on 19 April 2022. Retrieved 17 September 2020. ^ \"Cinema Express Awards\". The Indian Express. 17 March 1993. p. 4. Retrieved 22 February 2021 – via Google News Archive. ^ \"Revathy – My Awards\". revathy.com. Archived from the original on 2 October 2011. Retrieved 23 October 2011. ^ Jha, Subhash K (11 December 2015). \"'Best actor this country has produced': Kamal Haasan remembers Dilip Kumar on his 93th birthday\". Firstpost. Archived from the original on 13 December 2015. Retrieved 11 December 2015. ^ Panchal, Komal RJ (28 May 2022). \"Kamal Haasan says he held Dilip Kumar's hand, \"begged\" him to work in Thevar Magan Hindi remake: 'I wanted to but he had decided...'\". The Indian Express. Archived from the original on 28 May 2022. Retrieved 31 May 2022. ^ \"Kamal Haasan wanted to make Virasat with Dilip Kumar, 'begged' him to work in it\". Hindustan Times. 29 May 2022. Archived from the original on 8 November 2023. Retrieved 9 May 2024. ^ \"Not a patch on the original\". The Hindu. 2 April 2006. Archived from the original on 15 January 2015. Retrieved 12 September 2015. ^ \"\"Thevar Magan\" – \"Thevar Magan\" to \"Paruthiveeran\": Six best rural cinema you need to watch\". The Times of India. Archived from the original on 5 July 2020. Retrieved 24 April 2020. ^ \"Kamal announces 'Thevar Magan 2'\". The Hindu. 15 October 2018. Archived from the original on 5 July 2020. Retrieved 24 April 2020. ^ a b Karthikeyan, D. (2 May 2011). \"'Madurai formula' films and social realities\". The Hindu. Archived from the original on 22 July 2016. Retrieved 12 September 2015. ^ Velayutham 2008, p. 151. ^ \"Kamal never gives into mediocrity\". The Hindu. 1 September 2009. Archived from the original on 3 July 2020. Retrieved 3 July 2020. ^ Ashok Kumar, S.R. (10 November 2005). \"Devar Magan a turning point in my career\". The Hindu. Archived from the original on 28 September 2014. Retrieved 12 September 2015. ^ Naig, Udhav (5 June 2013). \"Life takes a colourful turn\". The Hindu. Archived from the original on 14 June 2013. Retrieved 4 July 2020. ^ \"Upbeat spirit\". The Hindu. 28 August 2009. Archived from the original on 26 February 2018. Retrieved 4 July 2020. ^ Menon, Gautham (8 February 2008). \"Why I like... Nayakan\". The Hindu. Archived from the original on 26 February 2018. Retrieved 4 July 2020. ^ \"My Inspirations: SJ Suryah\". Silverscreen.in. 28 July 2016. Archived from the original on 31 July 2016. Retrieved 12 August 2016. ^ \"Grill mill – Gouthami\". The Hindu. 23 January 2010. Archived from the original on 5 July 2020. Retrieved 4 July 2020. ^ \"Sandakozhi\". Sify. 16 December 2005. Archived from the original on 4 July 2020. Retrieved 4 July 2020. ^ \"Vetrivel Review: (Melo)dramatic\". Silverscreen.in. 23 April 2016. Archived from the original on 25 April 2016. Retrieved 30 April 2016. ^ \"Best of Vaali: From 1964 – 2013\". The Hindu. 19 July 2013. Archived from the original on 31 July 2017. Retrieved 12 September 2015. ^ Sathiya Moorthy, N. (22 July 2013). \"Remembering Vaali\". Rediff.com. Archived from the original on 17 May 2015. Retrieved 17 May 2015. ^ Srinivasan, Latha (7 November 2015). \"Birthday special: Films you must watch to grasp Kamal Haasan's repertoire\". Daily News & Analysis. Archived from the original on 5 March 2016. Retrieved 11 April 2016. Bibliography[edit] Baskaran, S. Theodore (2015) [2008]. Sivaji Ganesan: Profile of an Icon. Wisdom Tree. ISBN 9788183281096. Dhananjayan, G. (2014). Pride of Tamil Cinema: 1931–2013. Blue Ocean Publishers. OCLC 898765509. Mathai, Kamini (2009). A. R. Rahman: The Musical Storm. India: Penguin Books. ISBN 978-0-670-08371-8. Muthulakshmi, R. (1997). Female Infanticide, Its Causes and Solutions. Discovery Publishing. ISBN 978-8-17141-383-6. Raj, Maya (July 2010). \"Style Sutra: Kamal Haasan\". South Scope. Rajadhyaksha, Ashish; Willemen, Paul (1998) [1994]. Encyclopaedia of Indian Cinema. British Film Institute and Oxford University Press. ISBN 0-19-563579-5. Velayutham, Selvaraj (2008). Tamil Cinema:The Cultural Politics of India's other film country. Routledge. ISBN 978-0-415-39680-6. External links[edit] Thevar Magan at IMDb Thevar Magan at Rotten Tomatoes vteFilms directed by Bharathan Prayanam (1975) Guruvayur Kesavan (1977) Rathinirvedam (1978) Aniyara (1978) Aaravam (1978) Thakara (1979) Lorry (1980) Savithiri (1980) Chamaram (1980) Nidra (1981) Chaatta (1981) Parankimala (1981) Parvathy (1981) Marmaram (1982) Palangal (1982) Ormakkayi (1982) Eenam (1983) Sandhya Mayangum Neram (1983) Kattathe Kilikkoodu (1983) Ente Upasana (1984) Kathodu Kathoram (1985) Ozhivukaalam (1985) Pranamam (1986) Chilambu (1986) Oru Minnaminunginte Nurunguvettam (1987) Neela Kurinji Poothappol (1987) Vaisali (1988) Oru Sayahnathinte Swapnam (1989) Thazhvaram (1990) Malootty (1990) Amaram (1991) Keli (1991) Aavarampoo (1992) Thevar Magan (1992) Patheyam (1993) Venkalam (1993) Chamayam (1993) Devaraagam (1996) Churam (1997) Manjeeradhwani (1998) vteKamal Haasan Filmography Discography Unrealized projects Awards and honors As director Chachi 420 (1997) Hey Ram (2000) Virumaandi (2004) Vishwaroopam (2013) Vishwaroopam II (2018) As screenwriter Raja Paarvai (1981) Vikram (1986) Apoorva Sagodharargal (1989) Michael Madana Kama Rajan (1990) Thevar Magan (1992) Mahanadhi (1994) Nammavar (1995) Kuruthipunal (1995) Kaathala Kaathala (1998) Aalavandhan (2001) Panchatanthiram (2002) Anbe Sivam (2003) Nala Damayanthi (2003) Mumbai Xpress (2005) Dasavathaaram (2008) Manmadan Ambu (2010) Uttama Villain (2015) Thoongaa Vanam (2015) Related Marudhanayagam Raaj Kamal Films International Makkal Needhi Maiam People Shruti Haasan (daughter) Akshara Haasan (daughter) Charuhasan (brother) Chandrahasan (brother) vteRaaj Kamal Films InternationalKey people Kamal Haasan Chandrahasan Films Raja Paarvai (1981) Vikram (1986) Kadamai Kanniyam Kattupaadu (1987) Sathyaa (1988) Apoorva Sagodharargal (1989) Thevar Magan (1992) Magalir Mattum (1994) Kuruthipunal (1995) Sathi Leelavathi (1995) Chachi 420 (1997) Hey Ram (2000) Nala Damayanthi (2003) Virumaandi (2004) Mumbai Xpress (2005) Unnaipol Oruvan (2009) Vishwaroopam (2013) Uttama Villain (2015) Thoongaa Vanam (2015) Vishwaroopam II (2018) Kadaram Kondan (2019) Vikram (2022) Amaran (2024) Thug Life (2025) Marudhanayagam (TBA) Awards for Thevar Magan vteNational Film Award for Best Tamil Feature Film1954–1960 Malaikkallan (1954) – (1955) – (1956) – (1957) – (1958) Bhaaga Pirivinai (1959) Parthiban Kanavu (1960) Certificate of Merit Andha Naal and Edhir Paradhathu (1954) Mangaiyar Thilakam (1955) Kula Deivam (1956) Mudhalali (1957) Thanga Padhumai and Annaiyin Aanai (1958) Veerapandiya Kattabomman and Kalyana Parisu (1959) Paadhai Theriyudhu Paar and Kalathur Kannamma (1960) 1961–1980 Kappalottiya Thamizhan (1961) Nenjil Or Aalayam (1962) Naanum Oru Penn (1963) Kai Kodutha Deivam (1964) Kuzhandaiyum Deivamum (1965) Ramu (1966) Aalayam (1967) Thillana Mohanambal (1968) Iru Kodugal (1969) Raman Ethanai Ramanadi (1970) Veguli Penn (1971) Pattikada Pattanama (1972) Dikkatra Parvathi (1973) – (1974) Apoorva Raagangal (1975) – (1976) Agraharathil Kazhutai (1977) – (1978) Pasi (1979) Nenjathai Killathe (1980) Certificate of Merit Pasamalar and Kumudham (1961) Annai and Sarada (1962) Karpagam and Karnan (1963) Server Sundaram (1964) Thiruvilaiyadal (1965) Discontinued after 1965 1981–2000 Thanneer Thanneer (1981) Ezhavathu Manithan (1982) Oru Indhiya Kanavu (1983) Achamillai Achamillai (1984) Muthal Mariyathai (1985) Mouna Ragam (1986) Veedu (1987) – (1988) Pudhea Paadhai (1989) Anjali (1990) Vanna Vanna Pookkal (1991) Thevar Magan (1992) Mahanadhi (1993) Nammavar (1994) Anthimanthaarai (1995) Kadhal Kottai (1996) The Terrorist (1997) House Full (1998) Sethu (1999) Bharati (2000) 2001–2020 Ooruku Nooruper (2001) Kannathil Muthamittal (2002) Iyarkai (2003) Navarasa (2004) Aadum Koothu (2005) Veyil (2006) Periyar (2007) Vaaranam Aayiram (2008) Pasanga (2009) Thenmerku Paruvakaatru (2010) Vaagai Sooda Vaa (2011) Vazhakku Enn 18/9 (2012) Thanga Meenkal (2013) Kuttram Kadithal (2014) Visaranai (2015) Joker (2016) To Let (2017) Baaram (2018) Asuran (2019) Sivaranjiniyum Innum Sila Pengalum (2020) 2021–present Kadaisi Vivasayi (2021) Ponniyin Selvan: I (2022) Parking (2023) vteTamil Nadu State Film Award for Best Film1967– 79First prize Kaavalkaaran (1967) Uyarndha Manithan (1968) Adimai Penn (1969) Vietnam Veedu (1970) No Award (1971–1976) 16 Vayathinile (1977) Mullum Malarum (1978) Pasi (1979) Second prize Aalayam (1967) Thillana Mohanambal (1968) Akka Thangai (1969) Engal Thangam (1970) No Award (1971–1976) Madhurageetham (1977) Aval Appadithan (1978) Puthiya Vaarpugal (1979) Third prize Bama Vijayam (1967) Thamarai Nenjam (1968) Deiva Magan (1969) Namma Kuzhandaigal (1970) No Award (1971–1976) Bala Pareetchai (1977) Ilamai Oonjal Aadukirathu (1978) Thisai Maariya Paravaigal (1979) 1980– 89First prize Varumayin Niram Sivappu (1980) Alaigal Oivathillai (1981) Enkeyo Ketta Kural (1982) No Award (1983–1987) Poo Pootha Nandavanam (1988) Pudhea Paadhai (1989) Second prize Nenjathai Killathe (1980) Keezh Vaanam Sivakkum (1981) Agni Sakshi (1982) No Award (1983–1987) Paasa Paravaigal (1988) Pudhu Pudhu Arthangal (1989) Third prize Vandichakkaram (1980) Moondram Pirai (1981) Ezhavathu Manithan (1982) No Award (1983–1987) Agni Natchathiram (1988) Nyaya Tharasu (1989) 1990– 99First prize Pudhu Vasantham (1990) Chinna Thambi (1991) Roja (1992) Jaathi Malli (1993) Nattamai (1994) Anthimanthaarai (1995) Indian (1996) Arunachalam & Surya Vamsam (1997) Natpukkaga (1998) Padayappa (1999) Second prize Keladi Kannmanii (1990) En Rasavin Manasile (1991) Thevar Magan (1992) Pathini Penn (1993) Nammavar (1994) Kolangal (1995) Kadhal Kottai (1996) Porkkaalam (1997) Maru Malarchi (1998) Thullatha Manamum Thullum (1999) Third prize Kizhakku Vaasal (1990) Gunaa (1991) Chinna Gounder (1992) Gokulam (1993) Pavithra (1994) Avatharam (1995) Purushan Pondatti (1996) Arasiyal (1997) Unnidathil Ennai Koduthen (1998) Ethirum Puthirum (1999) 2000– 09First prize Vaanathaippola (2000) Virumbugiren (2001) Ramanaa (2002) Eera Nilam (2003) Autograph (2004) Chandramukhi & Ghajini (2005) Veyil (2006) Sivaji: The Boss (2007) Dasavathaaram (2008) Pasanga (2009) Second prize Vaanavil (2000) Pandavar Bhoomi (2001) Kannathil Muthamittal (2002) Power of Women (2003) Vishwa Thulasi (2004) Anniyan (2005) Paruthiveeran (2006) Mozhi (2007) Abhiyum Naanum (2008) Mayandi Kudumbathar (2009) Third prize Vetri Kodi Kattu (2000) Aanandham (2001) Unnai Ninaithu (2002) Parthiban Kanavu (2003) Kannadi Pookal (2004) Thavamai Thavamirundhu (2005) Thiruttu Payale (2006) Pallikoodam (2007) Santosh Subramaniam (2008) Achchamundu! Achchamundu! (2009) 2010– 15First prize Mynaa (2010) Vaagai Sooda Vaa (2011) Vazhakku Enn 18/9 (2012) Ramanujan (2013) Kuttram Kadithal (2014) Thani Oruvan (2015) Second prize Kalavani (2010) Deiva Thirumagal (2011) Saattai (2012) Thanga Meenkal (2013) Goli Soda (2014) Pasanga 2 (2015) Third prize Puthran (2010) Uchithanai Muharnthaal (2011) Dhoni (2012) Pannaiyarum Padminiyum (2013) Nimirndhu Nil (2014) Prabha (2015) vteIndian submission for Academy Award for Best International Feature Film1957–1980 Mother India (1957) Madhumati (1958) The World of Apu (1959) Sahib Bibi Aur Ghulam (1962) Mahanagar (1963) Guide (1965) Amrapali (1966) Aakhri Khat (1967) Majhli Didi (1968) Deiva Magan (1969) Reshma Aur Shera (1971) Uphaar (1972) Saudagar (1973) Garm Hava (1974) Manthan (1977) The Chess Players (1978) Payal Ki Jhankaar (1980) 1981–2000 Saaransh (1984) Saagar (1985) Swathi Muthyam (1986) Nayakan (1987) Salaam Bombay! (1988) Parinda (1989) Anjali (1990) Henna (1991) Thevar Magan (1992) Rudaali (1993) In Custody (1994) Kuruthipunal (1995) Indian (1996) Guru (1997) Jeans (1998) Earth (1999) Hey Ram (2000) 2001–2020 Lagaan (2001) Devdas (2002) Shwaas (2004) Paheli (2005) Rang De Basanti (2006) Eklavya: The Royal Guard (2007) Taare Zameen Par (2008) Harishchandrachi Factory (2009) Peepli Live (2010) Adaminte Makan Abu (2011) Barfi! (2012) The Good Road (2013) Liar's Dice (2014) Court (2015) Visaranai (2016) Newton (2017) Village Rockstars (2018) Gully Boy (2019) Jallikattu (2020) 2021–present Pebbles (2021) Last Film Show (2022) 2018 (2023) Laapataa Ladies (2024) This article needs additional or more specific categories. Please help out by adding categories to it so that it can be listed with similar articles. (August 2024) Retrieved from \"https://en.wikipedia.org/w/index.php?title=Thevar_Magan&oldid=1302917028\" Categories: 1992 films1990s Indian films1990s Tamil-language films1992 drama filmsBest Tamil Feature Film National Film Award winnersFilms about father–son relationshipsFilms about feudsFilms directed by BharathanFilms featuring a Best Supporting Actress National Film Award–winning performanceFilms scored by IlaiyaraajaFilms set in Tamil NaduFilms shot in ChennaiFilms shot in MaduraiFilms shot in OotyFilms shot in PollachiFilms shot in Tamil NaduFilms that won the Best Audiography National Film AwardFilms with screenplays by Kamal HaasanIndian drama filmsTamil films remade in other languagesTamil-language drama filmsTamil-language Indian filmsHidden categories: CS1 Tamil-language sources (ta)CS1: unfit URLArticles with short descriptionShort description is different from WikidataUse dmy dates from November 2021Use Indian English from November 2021All Wikipedia articles written in Indian EnglishTemplate film date with 1 release dateArticles needing additional categories from August 2024 Search Search Thevar Magan 9 languages Add topic",
    "word_count": 6748
  },
  "summary": {
    "summary": "Archived from the original on 4 July 2020. Archived from the original on 5 July 2020. Archived from the original on 3 July 2020. Archived from the original on 17 October 2015. Archived from the original on 6 June 2020. Archived from the original on 22 December 2015. Archived from the original on 2 July 2001. Archived from the original on 28 July 2020. Archived from the original on 25 August 2015. Archived from the original on 18 October 2020. Archived from the original on 10 October 2015. Archived from the original on 16 August 2015. Archived from the original on 17 December 2020. Archived from the original on 12 September 2013. Archived from the original on 5 October 2015. Archived from the original on 25 October 2022. Archived from the original on 25 July 2020. Archived from the original on 25 January 2020. Archived from the original on 15 November 2015. Archived from the original on 23 September 2015. Archived from the original on 26 October 2022. Archived from the original on 24 July 2013. Archived from the original on 2 October 2011. Archived from the original on 13 December 2015. Archived from the original on 15 January 2015. Archived from the original on 22 July 2016. Archived from the original on 28 September 2014. Archived from the original on 31 July 2016. Archived from the original on 31 July 2017. Archived from the original on 17 May 2015.",
    "key_concepts": [
      "Film",
      "Retrieved",
      "Archive",
      "Original",
      "Archived",
      "Thevar",
      "Maga",
      "Haasan",
      "July",
      "Magan",
      "Ram",
      "May"
    ],
    "method": "nltk_extractive"
  },
  "mind_maps": {
    "visual": "\n                            ╔════════════════════════════╗\n                            ║  THEVAR MAGAN - WIKIPEDIA  ║\n                            ╚════════════════════════════╝\n\n                                        │\n                                   ┌─────┴─────┐\n                                   │           │\n├── 📌 Film                         │                         📌 Maga ──┤\n├── 📌 Retrieved                    │                       📌 Haasan ──┤\n├── 📌 Archive                      │                         📌 July ──┤\n├── 📌 Original                     │                        📌 Magan ──┤\n├── 📌 Archived                     │                          📌 Ram ──┤\n├── 📌 Thevar                       │                          📌 May ──┤\n\n┌──────────────────────────────────────────────────────────────────────────────┐\n│                                   SUMMARY                                    │\n├──────────────────────────────────────────────────────────────────────────────┤\n│ Archived from the original on 4 July 2020. Archived from the original on 5  │\n│ July 2020. Archived from the original on 3 July 2020. Archived from the     │\n│ original on 17 October 2015. Archived from the original on 6 June 2020.     │\n│ Archived from the original on 22 December 2015. Archived from the original  │\n│ on 2 July 2001. Archived from the original on 28 July 2020. Archived from   │\n│ the original on 25 August 2015. Archived from the original on 18 October    │\n│ 2020. Archived from the original on 10 October 2015. Archived from the      │\n│ original on 16 August 2015. Archived from the original on 17 December       │\n│ 2020. Archived from the original on 12 September 2013. Archived from the    │\n│ original on 5 October 2015. Archived from the original on 25 October 2022.  │\n│ Archived from the original on 25 July 2020. Archived from the original on   │\n│ 25 January 2020. Archived from the original on 15 November 2015. Archived   │\n│ from the original on 23 September 2015. Archived from the original on 26    │\n│ October 2022. Archived from the original on 24 July 2013. Archived from     │\n│ the original on 2 October 2011. Archived from the original on 13 December   │\n│ 2015. Archived from the original on 15 January 2015. Archived from the      │\n│ original on 22 July 2016. Archived from the original on 28 September 2014.  │\n│ Archived from the original on 31 July 2016. Archived from the original on   │\n│ 31 July 2017. Archived from the original on 17 May 2015.                    │\n└──────────────────────────────────────────────────────────────────────────────┘",
    "network": "\n╔════════════════════════════════════════════════════════════╗\n║                      NETWORK MIND MAP                      ║\n╠════════════════════════════════════════════════════════════╣\n║                  Thevar Magan - Wikipedia                  ║\n╚════════════════════════════════════════════════════════════╝\n\n        🔵 Thevar Magan - Wikipedia\n        │\n   ┌────┴────┐\n   │         │\n   ├─ 🔸 Film\n   │         └─ 🔸 Retrieved\n   │         │\n   ├─ 🔸 Archive\n   │         └─ 🔸 Original\n   │         │\n   ├─ 🔸 Archived\n   │         └─ 🔸 Thevar\n   │         │\n   ├─ 🔸 Maga\n   │         └─ 🔸 Haasan\n   │\n   └─ 🔸 ... and more concepts",
    "hierarchical": "\n🌳 THEVAR MAGAN - WIKIPEDIA\n│\n├── 🌿 Film\n├── 🌿 Retrieved\n├── 🌿 Archive\n├── 🌿 Original\n├── 🌿 Archived\n├── 🌿 Thevar\n├── 🌿 Maga\n├── 🌿 Haasan\n├── 🌿 July\n├── 🌿 Magan\n├── 🌿 Ram\n└── 🌿 May"
  }
}