{
  "scraped_content": {
    "url": "https://en.wikipedia.org/wiki/Mullum_Malarum",
    "title": "Mullum Malarum - Wikipedia",
    "sections": [
      {
        "title": "Mullum Malarum - Wikipedia",
        "content": "Mullum Malarum (transl. 'The Thorn and the Flower' or 'Even a Thorn Will Bloom'; pronounced [muɭɭum maɭaɾum]) is a 1978 Indian Tamil-language drama film written and directed by Mahendran. Produced by Venu Chettiar and V. Mohan, the film stars Rajinikanth, Sarath Babu, Jayalaxmi and Shoba. It marks Mahendran's directorial debut and is partly based on Uma Chandran's novel of the same name, which was serialised in the Tamil magazine Kalki in 1966. Mullum Malarum tells the story of Kali (Rajinikanth), a winch operator of a cable trolley who dotes on his sister Valli (Shoba) since they were orphaned, and clashes with his boss Kumaran (Sarath Babu). Mahendran read only part of the novel, and developed the screenplay as he wanted, making a visually focused film without formulaic Tamil cinema conventions he disliked such as melodrama, overacting, excessive dialogue and duets. Since Mahendran had no previous directing experience, cinematographer Balu Mahendra, who was already an established director, assisted him with the screenplay, dialogue, camera angles, casting and editing. Principal photography lasted for about 30 days, taking place primarily in Sringeri, Karnataka, though some scenes were also filmed in Ooty, Tamil Nadu. The film was edited by D. Vasu, and the soundtrack was composed by Ilaiyaraaja. Mullum Malarum was released on 15 August 1978. Although it opened to tepid box-office earnings, positive reviews from critics and favourable word of mouth in later weeks helped make it a success with a theatrical run of over 100 days. The film received praise primarily for Rajinikanth's performance, Balu Mahendra's cinematography, Ilaiyaraaja's music, Mahendran's writing and establishing Tamil cinema as a \"visual medium\". It won the Filmfare Award for Best Film – Tamil, the Tamil Nadu State Film Award for Best Film and Rajinikanth won the Tamil Nadu State Film Award Special Prize for his performance. Mullum Malarum became a breakthrough for Rajinikanth as an actor and a milestone of Tamil cinema for focusing prominently on visuals and realism without the formulaic Tamil cinema conventions that Mahendran disliked. He continued following this style in all his later films. The film's success inspired a Malayalam remake titled Venalil Oru Mazha in 1979, a Telugu remake titled Seethamma Pelli in 1984, and a Hindi version titled Pyari Behna in 1985. ",
        "keywords": []
      },
      {
        "title": "Plot",
        "content": "Orphaned at a young age, Kali and his sister Valli survived by performing on the streets—Kali on the drums, Valli perched atop a pole balanced by an older boy. Kali frequently gets angry at people whom he thinks lack empathy for the socially or financially deprived. As adults, the siblings live in a hilltop village where Kali works for a powerhouse in the valley below. From a shed in the village, he operates a winch for a cable trolley which ferries employees to work. The powerhouse's new divisional engineer, the rule-abiding but fair Kumaran, notices Kali offering free rides to unauthorised townspeople. When he orders the passengers out, citing rules of operation, Kali becomes angry and stops the trolley half-way downhill. Kumaran shrugs off this act with a knowing smile. One day, while near the canal, Valli encounters a young woman named Manga, who, along with her mother, has arrived from a drought-stricken town, Ilaiyangudi. The mother is looking for work, and both women are hungry; Manga reveals a ravenous appetite for fish, which quickly becomes a defining trait. Valli feeds and shelters them for the night, and asks Kali about allowing them to use the vacant house next door. Meanwhile, Kali roughs up his fellow employees whom he suspects of snitching on him to Kumaran. Kali is given a final warning by Kumaran as a prelude to serious disciplinary action. While Kali is at work, Manga appears, picks up his watch and teasingly declares she will run away with it. They chase each other into the woods and end up waist-deep in the river, where Kali finally retrieves the watch and rushes back to the shed. During his absence, a child living in the valley has needed medical attention. After the emergency alarm at the shed has rung for several minutes, a passerby steps in to operate the winch. The child is transported back in the trolley and dispatched to a hospital. The following day, Kumaran suspends Kali from his job for ten days for gross misconduct. That evening, Kali goes to the nearby Mullimalai to assuage his anger at Kumaran among the Badagas, joining them in singing and dancing. While staggering back home drunk, Kali passes out on an unlit street. A truck drives over his left arm, which is amputated at a city hospital. As a result, Kumaran regretfully fires Kali since he can no longer perform his job adequately with one arm. At Valli's prompting, Kali and Manga agree to marry; they have a simple wedding ceremony held at the local temple. Kumaran attends and brings a present of cash, which Kali rejects, but Manga accepts. Kumaran becomes attracted to Valli. After determining her willingness for marriage, he requests permission from Kali who asks him to return the following day. Later that day, Kali corners Murgesan, a philandering local grocer, and offers him his sister's hand in marriage. An engagement ceremony for Murgesan and Valli is arranged. At the ceremony, Manga angrily interferes in the main ritual, which makes Kali furious at his wife. He physically assaults her repeatedly, but Manga remains firm in her opposition. The next day, Manga convinces Kumaran and Valli to marry without Kali's knowledge, but he accosts their wedding party on its way to the temple. Kali accuses his sister of abandoning him because of his handicap. Valli, overwhelmed with guilt, rushes into his arm. Kali holds her close, declaring that no matter what, he remains the most important man in her life. Though he still harbours resentment toward Kumaran, Kali's pride is restored. He offers his blessing. ",
        "keywords": []
      },
      {
        "title": "Development",
        "content": "Despite the success of his projects in the 1970s including Thangappathakkam (1974) and Aadu Puli Attam (1977), screenwriter Mahendran had become disillusioned with the mainstream Tamil cinema, which he criticised for its obsession with commercial success, routine melodrama, excessive dialogues, duets and a typical climax. He decided to take a sabbatical from screenwriting, but was under constant pressure from film producers to write for them. It was then that Mahendran began soliciting novels to adapt, one of which was Uma Chandran's Mullum Malarum (1966).[5] First serialised in the Tamil magazine Kalki,[6] it won the first prize in Kalki's novel competition for the magazine's silver jubilee in 1966.[7][8] While reading the novel, Mahendran was attracted by the protagonist Kali's job as a winch operator and his highly self-respecting character. He read until the chapter where Kali loses his arm to a tiger, and developed the screenplay completely according to his own wish.[9] Unlike the novel, in Mahendran's screenplay Kali loses his arm when it is run over by a truck.[10] Additionally, the novel ends with the deaths of Kali and his wife Manga, which Mahendran did not include in his screenplay.[11] Upon completion, Mahendran did not immediately pitch his story to investors, but instead \"quietly filed it away\", as he believed that no producer would want to produce a film that lacked all the formulaic Tamil cinema conventions. It was only after Venu Chettiar of Ananthi Films approached Mahendran with an offer that he pitched Mullum Malarum, describing it as a brother and sister story. Chettiar accepted the story without listening to it fully and wanted Mahendran to both write and direct the film.[5] Under the assumption that Chettiar had only accepted due to his belief that Mahendran would make a melodramatic brother-sister film like Pasamalar (1961), Mahendran refrained from disclosing to him that what he envisioned was radically different, with more focus on visuals than dramatics.[12] The film marked Mahendran's directorial debut,[13] with Chettiar and V. Mohan producing it.[14][b] Ramasamy was signed as the art director,[15] and D. Vasu as the editor.[16] Ramachandra Babu declined when approached by Mahendran to be the cinematographer, and Ashok Kumar, whom Ramachandra Babu suggested, could not accept to work on the film.[17][18] Mahendran was unable to find a worthy cinematographer until actor Kamal Haasan introduced him to Balu Mahendra, who agreed to work on the film, making his debut in Tamil cinema.[19][20] Haasan worked as a production manager on the film.[21] ",
        "keywords": []
      },
      {
        "title": "Casting and filming",
        "content": "After the release of Aadu Puli Attam, Mahendran wanted Rajinikanth, who portrayed the film's antagonist, to act as the male lead in his directorial debut film.[22] Though Chettiar remonstrated against the actor's suitability for the role due to his dark skin and typecasting as a villain, he reluctantly capitulated after Mahendran intransigently declared that he could not possibly direct the film without him, believing him to be tailor-made for the part.[23][24] After directing the Kannada film Kokila (1977), Balu Mahendra wanted its lead actress Shoba to act in his first Tamil film.[15] She was eventually cast as Kali's sister Valli.[1] Mahendran wanted Kamal Haasan in the role of the engineer Kumaran, but he declined, citing scheduling conflicts; the role went to Sarath Babu.[25] Mullum Malarum was filmed on 35 mm ORWO colour film.[26][27] It was shot primarily in Sringeri, Karnataka, with additional filming in Ooty, Tamil Nadu; principal photography lasted about 30 days.[28][29] Chettiar initially refused to let Mahendran shoot in Sringeri, citing financial constraints, but Mahendran's friend Pazhaniappan convinced Chettiar and agreed to pay for the Sringeri shooting schedule.[30] Once while passing through Pondicherry, Mahendran witnessed a game of Uriyadi, which inspired him to include two Uriyadi scenes in the film which were not originally part of the script.[31] Mahendran also decided to characterise Manga (Jayalaxmi) as a \"meen paithiyam\" (meaning a \"foodie who loves fish\") after being inspired by Sringeri's marine environment.[32][33] Balu Mahendra stated that he avoided incorporating the usual hero-heroine dancing into the film because he thought it was like \"watching two drunken monkeys dancing\". Instead, he allocated music to the background when the lead characters expressed their emotions.[34] Since Mahendran had no previous directing experience, Balu Mahendra, who was already an established director, assumed responsibility and responded to Mahendran's suggestions for screenplay, dialogue, camera angles, casting and editing.[15] He shot the film predominantly using natural light.[26] According to Mahendran, Chettiar never arrived at the shooting spot;[35] he expected a melodramatic, dialogue-heavy film,[5] and would have shelved the project had he known about Mahendran's filmmaking style.[35] Sarath Babu was originally supposed to lip sync the full \"Senthazham Poovil\" scene, picturised on Kumaran and Valli, but Mahendra and Mahendran agreed on a montage after the actor performed a line or two.[15] During the filming of the climax where Kali lets Kumaran marry Valli despite their enmity, Sarath Babu disputed the part where Kali professes to still dislike Kumaran, leading him to storm off the set. When he was brought back by the producer, he tempestuously confronted Mahendran, who informed him that Kali dislikes Kumaran till the end. He offered the possibility of filming it with Kali saying those words without Kumaran present, but Sarath Babu ultimately appeared.[36] After watching the film's double positive,[c] Chettiar was perplexed by the lack of melodrama and lengthy dialogues, since he hired Mahendran as director due to his success as a dialogue writer and did not expect such a visually focused film.[5][38] At that time, Mahendran had yet to film a scene set before \"Senthazham Poovil\" but Chettiar, discontent with the budget escalating, refused to finance it until he was won over by Haasan who financed the scene, and filming was completed.[5][19][39] Mullum Malarum's final reel length was 3,915.46 metres (12,846.0 ft).[40] ",
        "keywords": []
      },
      {
        "title": "Themes",
        "content": "Film critic Naman Ramachandran likened Kali's relationship with Valli to how flowers need thorns for protection.[10] According to critic Baradwaj Rangan, the title Mullum Malarum can be interpreted in two ways: \"the thorn and the flower\", which describes Kali and Valli; and \"even a thorn will bloom\", which foreshadows how Kali softens at the end.[41] Mahendran considered the latter to be the real meaning of the film's title.[42] S. Rajanayagam, author of the 2015 book Popular Cinema and Politics in South India: The Films of MGR and Rajinikanth, described Kali as the thorn and flower in the film; he characterised Kali as an \"angry young man with a kind heart\" who does not admit mistakes, despite having committed acts such as breaking car headlights and allowing people to ride the trolley, in violation of the powerhouse's rules.[43] He noted that films like Mullum Malarum stereotype the poor as \"all that is pristine and traditional\", and leave the \"overall socio-economic system\" which made them poor unchallenged, but within this system, \"the hero will be 'richer' in terms of his moral uprightness\".[44] Journalist Kavitha Muralidharan wrote that most of Mahendran's films show characters with contrasting personalities, citing the docile Valli and the garrulous Manga in Mullum Malarum as examples. Regarding this, Mahendran said, \"I only show them as they are in real life\".[45] According to film historian Yves Thoraval, Mullum Malarum explores \"the extreme Oedipal possessiveness of a married brother for his younger sister\". Thoraval said this was a recurring theme in Indian films starting with Bahen in 1941.[46] Ramachandran noted that Kali, like Rajinikanth's character in Bairavi (1978), is responsible for his sister's welfare. Unlike Bairavi, the siblings in Mullum Malarum are not separated; this leads Kali's protectiveness of Valli to the brink of obsession.[10] Ramachandran regarded egotism as one of Mullum Malarum's central themes, identifying Kali as the alpha male of his community.[47] According to an article published in Cinema Vision India, the film stresses \"that people change—and they must\".[48] Ramachandran noted that when Kali's arm is amputated, he feels helpless and emasculated, and Kumaran becomes an easy target. Kali refuses to see the benefits of his sister marrying a wealthy and educated man, even when Manga asks for his consent, but sees the error of his ways when Valli abandons her wedding party to join her brother: \"My sister has shown all of you that I am the most important person in her life. I need only that happiness for the rest of my life. And it is with that pride and arrogance that I give my permission for my sister to marry\".[26] Writing for Frontline, Venkatesh Chakravarthy noted that the film ends with Kali relenting to Valli's desire to marry the man she wishes but not before he tells Kumaran that he still dislikes him, \"which makes the film open-ended with a feel that life goes on\".[5] ",
        "keywords": []
      },
      {
        "title": "Music",
        "content": "Mullum Malarum's soundtrack was composed by Ilaiyaraaja, with lyrics by Panchu Arunachalam, Gangai Amaran and Kannadasan.[49][50] Unlike most Tamil films of that time, the film does not include any duets.[45] The song \"Adi Penney\" is set in the Carnatic raga known as Madhyamavati.[51] \"Raman Aandaalum\" is set in Mayamalavagowla,[52] and \"Senthazham Poovil\" is set in Bowli.[53] \"Maan Iname\", sung by Ilaiyaraaja, does not feature on the soundtrack.[54][49] Elements of \"Raman Aandaalum\" were later used in \"Machi Open the Bottle\", composed by Yuvan Shankar Raja for Mankatha (2011).[55][56] The song's lyrics also inspired the title of a 2021 film Raame Aandalum Raavane Aandalum.[57] For the Telugu-dubbed soundtrack Mullu Puvvu, L. Vaidyanathan composed two original tracks, apart from dubbing three of Ilaiyaraaja's compositions from the original soundtrack.[58][59] ",
        "keywords": []
      },
      {
        "title": "Release",
        "content": "Mullum Malarum was released on 15 August 1978.[60] As the film's commercial performance during its first few weeks was poor, both Mahendran and Rajinikanth summoned Chettiar to further publicise the film to improve its revenues. He declined, caustically replying that an unsuccessful film needs no publicity, and a successful film requires no publicity.[61] During its third or fourth week of release, positive magazine reviews and favourable word of mouth spread; Mullum Malarum became a commercial success, with a theatrical run of over 100 days.[d] Chettiar later apologised to Mahendran, who in turn thanked him for letting him make the film.[64] After watching the film and being impressed with Rajinikanth's performance, his mentor, director K. Balachander wrote in a letter of appreciation that he was proud to have introduced him as an actor in Tamil cinema.[65][66] Balachander's letter has been described by Sify as Rajinikanth's \"most prized moment and possession\".[67] It was screened at the 1979 International Film Festival of India as part of its Indian Panorama section.[2][e] ",
        "keywords": []
      },
      {
        "title": "Reception",
        "content": "Mullum Malarum was well received at the time of its initial release, with commentators applauding it for establishing Tamil cinema as a \"visual medium\".[64] The writer of a 25 August 1978 review in The Hindu appreciated the film for not having the \"usual formula of fights, duets, intrigues and cabaret dances\". The reviewer further noted that Rajinikanth showed \"his mature artistry in a portrayal of a turbulent illiterate worker with a blind passion for his sister\". The reviewer also praised the performances of Shoba and Jayalaxmi, called Balu Mahendra's camera work a \"feast for the eyes\", and Ilaiyaraaja's melodies \"delicious\". The critic was disappointed of the film's first half for moving at a \"leisurely pace\", but said the second half was \"eventful\".[4] The Tamil magazine Ananda Vikatan, in its 3 September 1978 review, applauded the performances of Rajinikanth and Sarath Babu, along with Balu Mahendra's cinematography and Ilaiyaraaja's music. The reviewer also praised Mahendran's filmmaking skills and the fact that he told the story in a sharp manner without long dialogues, likening the film to Kurinchi flowers due to their rarity and rating it 61 out of 100.[69] The Indian Express wrote, \"It is rare for a film to combine a good story, the right cast and technicians - ingredients vital for a satisfying film\" and Mullum Malaram \"succeeds because it has just the right balance\".[70] After watching the film, M. G. Ramachandran—the then Chief Minister of Tamil Nadu—told Mahendran that he had no words to express his happiness, and that Mahendran set a new trend in Tamil cinema with Mullum Malarum. Ramachandran stated that Mahendran had reached a milestone beyond expectations. He added that Mahendran demonstrated clearly that cinema is a \"visual medium\". Ramachandran commented that the depiction of brother-sister relationships in film up to this point were full of dramatics, even in his own, but Mullum Malarum stood apart in its realism. He said the final scene was new not only to Tamil cinema but also to Indian cinema. Ramachandran lauded Rajinikanth's realistic acting and hoped the film would mark a big turnaround in his career.[71] K. Balachander wrote in a letter of appreciation to Mahendran, \"[A]n intelligent filmmaker has come to the cinema world. Silence rules in many places in this film which deserve appreciation\".[61] ",
        "keywords": []
      },
      {
        "title": "Legacy",
        "content": "Mullum Malarum attained cult status in Tamil cinema.[75] It was a breakthrough for Rajinikanth as an actor and a milestone of Tamil cinema for focusing prominently on visuals and realism without the formulaic Tamil cinema conventions that Mahendran disliked.[45][76][77] Mahendran continued following this style in all his later films.[5] According to K. Balamurugan of Rediff.com, the film established that Rajinikanth \"can be a director's actor too\" and widened his fan base \"from youngsters to the families and the women\".[78] In December 2013, The Times of India said that with this film, Rajinikanth \"dispelled whatever doubts remained about his acting ability\".[79] Rajinikanth himself considers Mullum Malarum one of his five most favourite films[g] and Mahendran his favourite director.[24] Mullum Malarum was remade in Malayalam as Venalil Oru Mazha in 1979, in Telugu as Seethamma Pelli in 1984 (despite the dubbed Telugu version in 1979) and in Hindi as Pyari Behna (1985).[26][61] \"Kali\" (alternatively, Kaali) became Rajinikanth's most-frequent onscreen name; his characters in Kaali (1980), Kai Kodukkum Kai (1984) and Petta (2019) also shared that name.[81][82] In October 2015, director Pa. Ranjith said that Rajinikanth's characterisation in Mullum Malarum was a \"lesson\" of sorts for him, and the actor's character in Ranjith's Kabali (2016) was influenced by Kali in Mullum Malarum.[83] The film's score has been regarded as one of the best of Ilaiyaraaja's career by commentators; the songs \"Senthazham Poovil\" and \"Raman Aandalum\" in particular, remain hugely popular.[84][85][86] The latter was used in the climax sequence of Petta.[87][88] ",
        "keywords": []
      }
    ],
    "full_text": "Mullum Malarum - Wikipedia Jump to content From Wikipedia, the free encyclopedia 1978 film by J. Mahendran For the TV series, see Mullum Malarum (TV series). Mullum MalarumFilm posterDirected byMahendranScreenplay byMahendranBased onMullum Malarumby Uma ChandranProduced byVenu ChettiarV. MohanStarringRajinikanthSarath BabuJayalaxmiShobaCinematographyBalu MahendraEdited byD. VasuMusic byIlaiyaraajaProductioncompanyAnanthi FilmsRelease date 15 August 1978 (1978-08-15) Running time143–145 minutes[a]CountryIndiaLanguageTamil Mullum Malarum (transl. 'The Thorn and the Flower' or 'Even a Thorn Will Bloom'; pronounced [muɭɭum maɭaɾum]) is a 1978 Indian Tamil-language drama film written and directed by Mahendran. Produced by Venu Chettiar and V. Mohan, the film stars Rajinikanth, Sarath Babu, Jayalaxmi and Shoba. It marks Mahendran's directorial debut and is partly based on Uma Chandran's novel of the same name, which was serialised in the Tamil magazine Kalki in 1966. Mullum Malarum tells the story of Kali (Rajinikanth), a winch operator of a cable trolley who dotes on his sister Valli (Shoba) since they were orphaned, and clashes with his boss Kumaran (Sarath Babu). Mahendran read only part of the novel, and developed the screenplay as he wanted, making a visually focused film without formulaic Tamil cinema conventions he disliked such as melodrama, overacting, excessive dialogue and duets. Since Mahendran had no previous directing experience, cinematographer Balu Mahendra, who was already an established director, assisted him with the screenplay, dialogue, camera angles, casting and editing. Principal photography lasted for about 30 days, taking place primarily in Sringeri, Karnataka, though some scenes were also filmed in Ooty, Tamil Nadu. The film was edited by D. Vasu, and the soundtrack was composed by Ilaiyaraaja. Mullum Malarum was released on 15 August 1978. Although it opened to tepid box-office earnings, positive reviews from critics and favourable word of mouth in later weeks helped make it a success with a theatrical run of over 100 days. The film received praise primarily for Rajinikanth's performance, Balu Mahendra's cinematography, Ilaiyaraaja's music, Mahendran's writing and establishing Tamil cinema as a \"visual medium\". It won the Filmfare Award for Best Film – Tamil, the Tamil Nadu State Film Award for Best Film and Rajinikanth won the Tamil Nadu State Film Award Special Prize for his performance. Mullum Malarum became a breakthrough for Rajinikanth as an actor and a milestone of Tamil cinema for focusing prominently on visuals and realism without the formulaic Tamil cinema conventions that Mahendran disliked. He continued following this style in all his later films. The film's success inspired a Malayalam remake titled Venalil Oru Mazha in 1979, a Telugu remake titled Seethamma Pelli in 1984, and a Hindi version titled Pyari Behna in 1985. Plot[edit] Orphaned at a young age, Kali and his sister Valli survived by performing on the streets—Kali on the drums, Valli perched atop a pole balanced by an older boy. Kali frequently gets angry at people whom he thinks lack empathy for the socially or financially deprived. As adults, the siblings live in a hilltop village where Kali works for a powerhouse in the valley below. From a shed in the village, he operates a winch for a cable trolley which ferries employees to work. The powerhouse's new divisional engineer, the rule-abiding but fair Kumaran, notices Kali offering free rides to unauthorised townspeople. When he orders the passengers out, citing rules of operation, Kali becomes angry and stops the trolley half-way downhill. Kumaran shrugs off this act with a knowing smile. One day, while near the canal, Valli encounters a young woman named Manga, who, along with her mother, has arrived from a drought-stricken town, Ilaiyangudi. The mother is looking for work, and both women are hungry; Manga reveals a ravenous appetite for fish, which quickly becomes a defining trait. Valli feeds and shelters them for the night, and asks Kali about allowing them to use the vacant house next door. Meanwhile, Kali roughs up his fellow employees whom he suspects of snitching on him to Kumaran. Kali is given a final warning by Kumaran as a prelude to serious disciplinary action. While Kali is at work, Manga appears, picks up his watch and teasingly declares she will run away with it. They chase each other into the woods and end up waist-deep in the river, where Kali finally retrieves the watch and rushes back to the shed. During his absence, a child living in the valley has needed medical attention. After the emergency alarm at the shed has rung for several minutes, a passerby steps in to operate the winch. The child is transported back in the trolley and dispatched to a hospital. The following day, Kumaran suspends Kali from his job for ten days for gross misconduct. That evening, Kali goes to the nearby Mullimalai to assuage his anger at Kumaran among the Badagas, joining them in singing and dancing. While staggering back home drunk, Kali passes out on an unlit street. A truck drives over his left arm, which is amputated at a city hospital. As a result, Kumaran regretfully fires Kali since he can no longer perform his job adequately with one arm. At Valli's prompting, Kali and Manga agree to marry; they have a simple wedding ceremony held at the local temple. Kumaran attends and brings a present of cash, which Kali rejects, but Manga accepts. Kumaran becomes attracted to Valli. After determining her willingness for marriage, he requests permission from Kali who asks him to return the following day. Later that day, Kali corners Murgesan, a philandering local grocer, and offers him his sister's hand in marriage. An engagement ceremony for Murgesan and Valli is arranged. At the ceremony, Manga angrily interferes in the main ritual, which makes Kali furious at his wife. He physically assaults her repeatedly, but Manga remains firm in her opposition. The next day, Manga convinces Kumaran and Valli to marry without Kali's knowledge, but he accosts their wedding party on its way to the temple. Kali accuses his sister of abandoning him because of his handicap. Valli, overwhelmed with guilt, rushes into his arm. Kali holds her close, declaring that no matter what, he remains the most important man in her life. Though he still harbours resentment toward Kumaran, Kali's pride is restored. He offers his blessing. Cast[edit] Rajinikanth as Kali Sarath Babu as Kumaran Jayalaxmi as Manga Shoba as Valli Vennira Aadai Moorthy as Murugesan[3] Samikannu as Mayandi[4] Production[edit] Development[edit] Despite the success of his projects in the 1970s including Thangappathakkam (1974) and Aadu Puli Attam (1977), screenwriter Mahendran had become disillusioned with the mainstream Tamil cinema, which he criticised for its obsession with commercial success, routine melodrama, excessive dialogues, duets and a typical climax. He decided to take a sabbatical from screenwriting, but was under constant pressure from film producers to write for them. It was then that Mahendran began soliciting novels to adapt, one of which was Uma Chandran's Mullum Malarum (1966).[5] First serialised in the Tamil magazine Kalki,[6] it won the first prize in Kalki's novel competition for the magazine's silver jubilee in 1966.[7][8] While reading the novel, Mahendran was attracted by the protagonist Kali's job as a winch operator and his highly self-respecting character. He read until the chapter where Kali loses his arm to a tiger, and developed the screenplay completely according to his own wish.[9] Unlike the novel, in Mahendran's screenplay Kali loses his arm when it is run over by a truck.[10] Additionally, the novel ends with the deaths of Kali and his wife Manga, which Mahendran did not include in his screenplay.[11] Upon completion, Mahendran did not immediately pitch his story to investors, but instead \"quietly filed it away\", as he believed that no producer would want to produce a film that lacked all the formulaic Tamil cinema conventions. It was only after Venu Chettiar of Ananthi Films approached Mahendran with an offer that he pitched Mullum Malarum, describing it as a brother and sister story. Chettiar accepted the story without listening to it fully and wanted Mahendran to both write and direct the film.[5] Under the assumption that Chettiar had only accepted due to his belief that Mahendran would make a melodramatic brother-sister film like Pasamalar (1961), Mahendran refrained from disclosing to him that what he envisioned was radically different, with more focus on visuals than dramatics.[12] The film marked Mahendran's directorial debut,[13] with Chettiar and V. Mohan producing it.[14][b] Ramasamy was signed as the art director,[15] and D. Vasu as the editor.[16] Ramachandra Babu declined when approached by Mahendran to be the cinematographer, and Ashok Kumar, whom Ramachandra Babu suggested, could not accept to work on the film.[17][18] Mahendran was unable to find a worthy cinematographer until actor Kamal Haasan introduced him to Balu Mahendra, who agreed to work on the film, making his debut in Tamil cinema.[19][20] Haasan worked as a production manager on the film.[21] Casting and filming[edit] After the release of Aadu Puli Attam, Mahendran wanted Rajinikanth, who portrayed the film's antagonist, to act as the male lead in his directorial debut film.[22] Though Chettiar remonstrated against the actor's suitability for the role due to his dark skin and typecasting as a villain, he reluctantly capitulated after Mahendran intransigently declared that he could not possibly direct the film without him, believing him to be tailor-made for the part.[23][24] After directing the Kannada film Kokila (1977), Balu Mahendra wanted its lead actress Shoba to act in his first Tamil film.[15] She was eventually cast as Kali's sister Valli.[1] Mahendran wanted Kamal Haasan in the role of the engineer Kumaran, but he declined, citing scheduling conflicts; the role went to Sarath Babu.[25] Mullum Malarum was filmed on 35 mm ORWO colour film.[26][27] It was shot primarily in Sringeri, Karnataka, with additional filming in Ooty, Tamil Nadu; principal photography lasted about 30 days.[28][29] Chettiar initially refused to let Mahendran shoot in Sringeri, citing financial constraints, but Mahendran's friend Pazhaniappan convinced Chettiar and agreed to pay for the Sringeri shooting schedule.[30] Once while passing through Pondicherry, Mahendran witnessed a game of Uriyadi, which inspired him to include two Uriyadi scenes in the film which were not originally part of the script.[31] Mahendran also decided to characterise Manga (Jayalaxmi) as a \"meen paithiyam\" (meaning a \"foodie who loves fish\") after being inspired by Sringeri's marine environment.[32][33] Balu Mahendra stated that he avoided incorporating the usual hero-heroine dancing into the film because he thought it was like \"watching two drunken monkeys dancing\". Instead, he allocated music to the background when the lead characters expressed their emotions.[34] Since Mahendran had no previous directing experience, Balu Mahendra, who was already an established director, assumed responsibility and responded to Mahendran's suggestions for screenplay, dialogue, camera angles, casting and editing.[15] He shot the film predominantly using natural light.[26] According to Mahendran, Chettiar never arrived at the shooting spot;[35] he expected a melodramatic, dialogue-heavy film,[5] and would have shelved the project had he known about Mahendran's filmmaking style.[35] Sarath Babu was originally supposed to lip sync the full \"Senthazham Poovil\" scene, picturised on Kumaran and Valli, but Mahendra and Mahendran agreed on a montage after the actor performed a line or two.[15] During the filming of the climax where Kali lets Kumaran marry Valli despite their enmity, Sarath Babu disputed the part where Kali professes to still dislike Kumaran, leading him to storm off the set. When he was brought back by the producer, he tempestuously confronted Mahendran, who informed him that Kali dislikes Kumaran till the end. He offered the possibility of filming it with Kali saying those words without Kumaran present, but Sarath Babu ultimately appeared.[36] After watching the film's double positive,[c] Chettiar was perplexed by the lack of melodrama and lengthy dialogues, since he hired Mahendran as director due to his success as a dialogue writer and did not expect such a visually focused film.[5][38] At that time, Mahendran had yet to film a scene set before \"Senthazham Poovil\" but Chettiar, discontent with the budget escalating, refused to finance it until he was won over by Haasan who financed the scene, and filming was completed.[5][19][39] Mullum Malarum's final reel length was 3,915.46 metres (12,846.0 ft).[40] Themes[edit] Film critic Naman Ramachandran likened Kali's relationship with Valli to how flowers need thorns for protection.[10] According to critic Baradwaj Rangan, the title Mullum Malarum can be interpreted in two ways: \"the thorn and the flower\", which describes Kali and Valli; and \"even a thorn will bloom\", which foreshadows how Kali softens at the end.[41] Mahendran considered the latter to be the real meaning of the film's title.[42] S. Rajanayagam, author of the 2015 book Popular Cinema and Politics in South India: The Films of MGR and Rajinikanth, described Kali as the thorn and flower in the film; he characterised Kali as an \"angry young man with a kind heart\" who does not admit mistakes, despite having committed acts such as breaking car headlights and allowing people to ride the trolley, in violation of the powerhouse's rules.[43] He noted that films like Mullum Malarum stereotype the poor as \"all that is pristine and traditional\", and leave the \"overall socio-economic system\" which made them poor unchallenged, but within this system, \"the hero will be 'richer' in terms of his moral uprightness\".[44] Journalist Kavitha Muralidharan wrote that most of Mahendran's films show characters with contrasting personalities, citing the docile Valli and the garrulous Manga in Mullum Malarum as examples. Regarding this, Mahendran said, \"I only show them as they are in real life\".[45] According to film historian Yves Thoraval, Mullum Malarum explores \"the extreme Oedipal possessiveness of a married brother for his younger sister\". Thoraval said this was a recurring theme in Indian films starting with Bahen in 1941.[46] Ramachandran noted that Kali, like Rajinikanth's character in Bairavi (1978), is responsible for his sister's welfare. Unlike Bairavi, the siblings in Mullum Malarum are not separated; this leads Kali's protectiveness of Valli to the brink of obsession.[10] Ramachandran regarded egotism as one of Mullum Malarum's central themes, identifying Kali as the alpha male of his community.[47] According to an article published in Cinema Vision India, the film stresses \"that people change—and they must\".[48] Ramachandran noted that when Kali's arm is amputated, he feels helpless and emasculated, and Kumaran becomes an easy target. Kali refuses to see the benefits of his sister marrying a wealthy and educated man, even when Manga asks for his consent, but sees the error of his ways when Valli abandons her wedding party to join her brother: \"My sister has shown all of you that I am the most important person in her life. I need only that happiness for the rest of my life. And it is with that pride and arrogance that I give my permission for my sister to marry\".[26] Writing for Frontline, Venkatesh Chakravarthy noted that the film ends with Kali relenting to Valli's desire to marry the man she wishes but not before he tells Kumaran that he still dislikes him, \"which makes the film open-ended with a feel that life goes on\".[5] Music[edit] Mullum Malarum's soundtrack was composed by Ilaiyaraaja, with lyrics by Panchu Arunachalam, Gangai Amaran and Kannadasan.[49][50] Unlike most Tamil films of that time, the film does not include any duets.[45] The song \"Adi Penney\" is set in the Carnatic raga known as Madhyamavati.[51] \"Raman Aandaalum\" is set in Mayamalavagowla,[52] and \"Senthazham Poovil\" is set in Bowli.[53] \"Maan Iname\", sung by Ilaiyaraaja, does not feature on the soundtrack.[54][49] Elements of \"Raman Aandaalum\" were later used in \"Machi Open the Bottle\", composed by Yuvan Shankar Raja for Mankatha (2011).[55][56] The song's lyrics also inspired the title of a 2021 film Raame Aandalum Raavane Aandalum.[57] For the Telugu-dubbed soundtrack Mullu Puvvu, L. Vaidyanathan composed two original tracks, apart from dubbing three of Ilaiyaraaja's compositions from the original soundtrack.[58][59] TamilNo.TitleLyricsSinger(s)Length1.\"Senthazham Poovil\"KannadasanK. J. Yesudas4:352.\"Adi Penney\"Panchu ArunachalamJency Anthony4:303.\"Raman Aandaalum\"Gangai AmaranS. P. Balasubrahmanyam, L. R. Anjali and Chorus5:444.\"Niththam Niththam\"Gangai AmaranVani Jairam2:54 TeluguNo.TitleLyricsMusicSinger(s)Length1.\"Jeevana Sangramamulo\"ArudhraL. VaidyanathanP. Susheela4:022.\"Andala Mulaka\"RajasriIlaiyaraajaS. P. Balasubrahmanyam4:093.\"Sakkanaina Saddikudu\"RajasriIlaiyaraajaS. Janaki2:314.\"Pilla\"ArudhraL. VaidyanathanP. Susheela4:045.\"Ramudu Raajainaa\"RajasriIlaiyaraajaS. P. Balasubrahmanyam5:19 Release[edit] Mullum Malarum was released on 15 August 1978.[60] As the film's commercial performance during its first few weeks was poor, both Mahendran and Rajinikanth summoned Chettiar to further publicise the film to improve its revenues. He declined, caustically replying that an unsuccessful film needs no publicity, and a successful film requires no publicity.[61] During its third or fourth week of release, positive magazine reviews and favourable word of mouth spread; Mullum Malarum became a commercial success, with a theatrical run of over 100 days.[d] Chettiar later apologised to Mahendran, who in turn thanked him for letting him make the film.[64] After watching the film and being impressed with Rajinikanth's performance, his mentor, director K. Balachander wrote in a letter of appreciation that he was proud to have introduced him as an actor in Tamil cinema.[65][66] Balachander's letter has been described by Sify as Rajinikanth's \"most prized moment and possession\".[67] It was screened at the 1979 International Film Festival of India as part of its Indian Panorama section.[2][e] Reception[edit] Mullum Malarum was well received at the time of its initial release, with commentators applauding it for establishing Tamil cinema as a \"visual medium\".[64] The writer of a 25 August 1978 review in The Hindu appreciated the film for not having the \"usual formula of fights, duets, intrigues and cabaret dances\". The reviewer further noted that Rajinikanth showed \"his mature artistry in a portrayal of a turbulent illiterate worker with a blind passion for his sister\". The reviewer also praised the performances of Shoba and Jayalaxmi, called Balu Mahendra's camera work a \"feast for the eyes\", and Ilaiyaraaja's melodies \"delicious\". The critic was disappointed of the film's first half for moving at a \"leisurely pace\", but said the second half was \"eventful\".[4] The Tamil magazine Ananda Vikatan, in its 3 September 1978 review, applauded the performances of Rajinikanth and Sarath Babu, along with Balu Mahendra's cinematography and Ilaiyaraaja's music. The reviewer also praised Mahendran's filmmaking skills and the fact that he told the story in a sharp manner without long dialogues, likening the film to Kurinchi flowers due to their rarity and rating it 61 out of 100.[69] The Indian Express wrote, \"It is rare for a film to combine a good story, the right cast and technicians - ingredients vital for a satisfying film\" and Mullum Malaram \"succeeds because it has just the right balance\".[70] After watching the film, M. G. Ramachandran—the then Chief Minister of Tamil Nadu—told Mahendran that he had no words to express his happiness, and that Mahendran set a new trend in Tamil cinema with Mullum Malarum. Ramachandran stated that Mahendran had reached a milestone beyond expectations. He added that Mahendran demonstrated clearly that cinema is a \"visual medium\". Ramachandran commented that the depiction of brother-sister relationships in film up to this point were full of dramatics, even in his own, but Mullum Malarum stood apart in its realism. He said the final scene was new not only to Tamil cinema but also to Indian cinema. Ramachandran lauded Rajinikanth's realistic acting and hoped the film would mark a big turnaround in his career.[71] K. Balachander wrote in a letter of appreciation to Mahendran, \"[A]n intelligent filmmaker has come to the cinema world. Silence rules in many places in this film which deserve appreciation\".[61] Accolades[edit] Event[f] Category Recipient(s) Ref. Arima Sangam Awards Best Actor Rajinikanth [72] Filmfare Awards South Best Film – Tamil Mullum Malarum [73] Tamil Nadu State Film Awards Best Film [26][74] Special Prize (Best Actor) Rajinikanth Legacy[edit] Mullum Malarum attained cult status in Tamil cinema.[75] It was a breakthrough for Rajinikanth as an actor and a milestone of Tamil cinema for focusing prominently on visuals and realism without the formulaic Tamil cinema conventions that Mahendran disliked.[45][76][77] Mahendran continued following this style in all his later films.[5] According to K. Balamurugan of Rediff.com, the film established that Rajinikanth \"can be a director's actor too\" and widened his fan base \"from youngsters to the families and the women\".[78] In December 2013, The Times of India said that with this film, Rajinikanth \"dispelled whatever doubts remained about his acting ability\".[79] Rajinikanth himself considers Mullum Malarum one of his five most favourite films[g] and Mahendran his favourite director.[24] Mullum Malarum was remade in Malayalam as Venalil Oru Mazha in 1979, in Telugu as Seethamma Pelli in 1984 (despite the dubbed Telugu version in 1979) and in Hindi as Pyari Behna (1985).[26][61] \"Kali\" (alternatively, Kaali) became Rajinikanth's most-frequent onscreen name; his characters in Kaali (1980), Kai Kodukkum Kai (1984) and Petta (2019) also shared that name.[81][82] In October 2015, director Pa. Ranjith said that Rajinikanth's characterisation in Mullum Malarum was a \"lesson\" of sorts for him, and the actor's character in Ranjith's Kabali (2016) was influenced by Kali in Mullum Malarum.[83] The film's score has been regarded as one of the best of Ilaiyaraaja's career by commentators; the songs \"Senthazham Poovil\" and \"Raman Aandalum\" in particular, remain hugely popular.[84][85][86] The latter was used in the climax sequence of Petta.[87][88] Notes[edit] ^ The film's runtime is listed in Encyclopedia of Indian Cinema as 143 minutes,[1] but the version screened at the 1979 International Film Festival of India was 145 minutes long.[2] ^ Only Mohan's name appeared in the opening credits. ^ Double positive is the stage when dubbing for a film has been completed, and picture and sound are on separate tracks—a raw copy where visual effects and re-recording remain to be done.[37] ^ Film historian G. Dhananjayan states that the film picked up after its second week,[62] but J. Mahendran wrote in his autobiographical Cinemavum Naanum that the film's commercial performance improved in its fourth week of release and did not cease after 100 days.[63] ^ Indian Panorama is a flagship component of the IFFI under which the best of contemporary Indian films are selected for the promotion of film art.[68] ^ Awards, festivals and organisations are in alphabetical order. ^ The other four films are Bhuvana Oru Kelvi Kuri (1977), Aarilirunthu Arubathu Varai (1979), Enkeyo Ketta Kural (1982) and Sri Raghavendrar (1985).[80] References[edit] ^ a b Rajadhyaksha & Willemen 1998, p. 437. ^ a b \"Indian Panorama 1979\" (PDF). International Film Festival of India. 1979. pp. 138–139. Archived from the original (PDF) on 6 January 2017. Retrieved 6 January 2017. ^ Vamanan (22 July 2015). \"Raising laughs with those bubbly sounds\". The Times of India. Archived from the original on 26 July 2015. Retrieved 26 July 2015. ^ a b Ramachandran, Naman, ed. (2012). Rajinikanth 12.12.12: A Birthday Special. Kasturi & Sons Ltd. p. 68. ^ a b c d e f g Chakravarthy, Venkatesh (24 April 2019). \"Icon of change\". Frontline. Archived from the original on 14 July 2019. Retrieved 14 July 2019. ^ \"கல்கி இதழுக்கு வயது, 75!\" [The Kalki magazine's age is 75!]. Dinamalar (in Tamil). 30 August 2015. Archived from the original on 30 August 2018. Retrieved 30 August 2018. ^ Sadasivam, T. (28 August 1966). \"Twenty-five Years of Kalki\". Bhavan's Journal. Vol. 13. pp. 53–57. OCLC 500022666. ^ Selvaraj, N. (12 January 2015). \"நாவல் – விருதுகளும் பரிசுகளும்\" [Novel – Awards and prizes]. Thinnai (in Tamil). Archived from the original on 11 February 2015. Retrieved 30 August 2018. ^ Mahendran 2013, p. 106. ^ a b c Ramachandran 2014, p. 81. ^ Mahendran 2013, p. 121. ^ Mahendran 2013, pp. 109–110. ^ Rajadhyaksha & Willemen 1998, pp. 141, 437. ^ Mullum Malarum (motion picture) (in Tamil). Ananthi Films. 1978. Opening credits, from 0:00 to 4:10. ^ a b c d Mahendra, Balu (21 April 2013). \"முள்ளும் மலரும் படத்தில் நான்\" [Me in the film Mullum Malarum]. மூன்றாம் பிறை... (in Tamil). Archived from the original on 2 November 2013. Retrieved 19 December 2013. ^ Dharap 1977, p. 325. ^ Srinivasan, Sudhir (25 October 2014). \"My friend Ashok\". The Hindu. Archived from the original on 26 October 2014. Retrieved 26 October 2014. ^ Warrier, Shobha (25 March 1999). \"Alas, realistic movies are dead\". Rediff.com. Archived from the original on 14 March 2003. Retrieved 4 July 2015. ^ a b \"It was Kamal, who introduced Balu Mahendra to me: Mahendran\". Sify. 19 April 2016. Archived from the original on 20 April 2016. Retrieved 20 April 2016. ^ \"Balu Mahendra was also a literary figure\". Ceylon Today. 17 February 2014. Archived from the original on 5 July 2015. Retrieved 24 April 2014. ^ \"I was supposed to do Mullum Malarum: Kamal Haasan's emotional speech at veteran director Mahendran's funeral\". In.com. 2 April 2019. Archived from the original on 4 April 2019. Retrieved 7 May 2019. ^ \"Mahendran found Rajinikanth and made him Superstar. How Mullum Malarum became a cult\". India Today. 2 April 2019. Archived from the original on 29 April 2019. Retrieved 29 April 2019. ^ Mahendran 2013, pp. 111–112. ^ a b Venkadesan, S. (12 December 2012). \"He could have missed out on his favourite film\". The New Indian Express. Archived from the original on 9 December 2015. Retrieved 24 November 2013. ^ பாரதி, திரை (27 November 2021). \"ஆறிலிருந்து எழுபது வரை: ரஜினி சரிதம் - 43\" [From Six to Seventy: Rajini's history – 43]. Kamadenu (in Tamil). Archived from the original on 17 September 2022. Retrieved 17 September 2022. ^ a b c d e Ramachandran 2014, p. 82. ^ Ramnarayan, Gowri (12 April 2002). \"Cannes is not my goal\". The Hindu. Archived from the original on 8 September 2003. Retrieved 26 November 2013. ^ Aravind, C. V. (6 January 2017). \"The cinema of J Mahendran: Social milieu was his canvas\". The News Minute. Archived from the original on 10 January 2017. Retrieved 10 January 2017. ^ Mahendran 2013, p. 112. ^ Mahendran 2013, pp. 113–114. ^ Mahendran 2013, p. 115. ^ Jeshi, K. (15 December 2013). \"Flashbacks of a director\". The Hindu. Archived from the original on 16 December 2013. Retrieved 16 December 2013. ^ Mahendran 2013, pp. 115–116. ^ \"Angadi Theru Audio Launch- A simple report!\". Ayngaran International. 4 May 2009. Archived from the original on 22 November 2013. Retrieved 23 November 2013. ^ a b Manoj Kumar, R. (2 April 2019). \"J Mahendran, the director who invented \"Rajini style\"\". The Indian Express. Archived from the original on 7 April 2019. Retrieved 7 May 2019. ^ Mahendran 2013, pp. 116–117. ^ Krissna & Rangarajan 2012, pp. 83–84. ^ Mahendran 2013, pp. 117–118. ^ Mahendran 2013, pp. 238–240. ^ \"Mullum Malarum (Tamil)\". Central Board of Film Certification. 4 August 1978. Archived from the original on 2 December 2013. Retrieved 5 October 2015. ^ Rangan, Baradwaj (12 December 2017). \"Southern Lights: Introducing... Rajinikanth!\". Film Companion. Archived from the original on 15 April 2023. Retrieved 21 December 2017. ^ Mahendran 2013, p. 234. ^ Rajanayagam 2015, pp. 89–90. ^ Rajanayagam 2015, p. 79. ^ a b c Muralidharan, Kavitha (10 August 2013). \"Second coming?\". The Hindu. Archived from the original on 14 August 2013. Retrieved 30 November 2013. ^ Thoraval 2000, p. 333. ^ Ramachandran 2014, pp. 81–82. ^ Rao, M. S.; Hariharan, K. (1980). \"Tamil Nadu\". Cinema Vision India. Vol. 1, no. 2–4. p. 59. ^ a b \"Mullum Malarum Tamil Film EP Vinyl Record by Ilayaraja\". Mossymart. Archived from the original on 3 August 2021. Retrieved 3 August 2021. ^ \"Mullum Malarum (1978)\". Music India Online. Archived from the original on 5 April 2018. Retrieved 5 April 2018. ^ Sundararaman 2007, p. 121. ^ Sundararaman 2007, p. 146. ^ Sundararaman 2007, p. 157. ^ Ilaiyaraaja (9 July 2015). \"இசையமைப்பாளர்களில் அதிகபாடல்கள் பாடியவர் இசைஞானி இளையராஜாதானாம்...\" [Ilaiyaraaja is the composer who sang the most number of songs]. Facebook. Archived from the original on 1 September 2019. Retrieved 1 September 2019. ^ Rao, Sudha (15 September 2011). \"Music Review: Mankatha\". Lokvani.com. New England. Archived from the original on 15 November 2012. Retrieved 23 November 2013. ^ \"மங்காத்தாவில் நடிக்க மிரட்டப்பட்டாரா அஜீத்!\" [Ajith was forced to act in Mankatha]. Nakkheeran (in Tamil). August 2011. Archived from the original on 28 July 2012. Retrieved 22 April 2016. ^ Aiyappan, Ashameera (24 September 2021). \"Raame Aandalum Raavane Aandalum movie review: A well-intentioned but middling social drama\". Firstpost. Archived from the original on 5 October 2021. Retrieved 15 June 2022. ^ \"Mullu Puvvu Telugu FIlm EP Vinyl Record by Ilayaraja\". Mossymart. Archived from the original on 22 October 2021. Retrieved 25 October 2021. ^ \"Mullu Puvvu\". Indiancine.ma. Archived from the original on 9 April 2024. Retrieved 29 November 2021. ^ \"ஸ்பெஷல் ரிப்போர்ட்: ரஜினிகாந்த் – டாப் 20 திரைப்படங்கள்\" [Special Report: Rajinikanth – Top 20 films]. Dinamalar (in Tamil). 12 December 2014. Archived from the original on 11 May 2016. Retrieved 11 May 2016. ^ a b c Dhananjayan 2014, p. 254. ^ Dhananjayan, G. (16 December 2016). \"People's review often rewrites box office fate of films, writes G Dhananjayan\". DT Next. Archived from the original on 12 September 2019. Retrieved 18 September 2019. ^ Mahendran 2013, pp. 119–120. ^ a b Mahendran 2013, p. 120. ^ Ramachandran 2014, pp. 82–83. ^ \"Mullum Malarum director J. Mahendran passes away\". The Hindu. 3 April 2019. Archived from the original on 5 April 2019. Retrieved 5 April 2019. ^ \"Rajinikanth in Kathanayakudu\". Sify. Archived from the original on 17 December 2013. Retrieved 17 December 2013. ^ \"Indian Panorama\". Directorate of Film Festivals. Archived from the original on 5 May 2019. Retrieved 31 August 2019. ^ \"சினிமா விமர்சனம்: முள்ளும் மலரும்\" [Movie Review: Mullum Malarum]. Ananda Vikatan (in Tamil). 3 September 1978. Archived from the original on 3 August 2021. Retrieved 1 August 2019. ^ B, Jayabhuvaneshwari (14 August 2025). \"50 years of Rajinikanth: What Cinema Express critics thought of superstar's films over the ages\". Cinema Express. Archived from the original on 15 August 2025. Retrieved 15 August 2025. ^ Dhananjayan 2014, pp. 253–254. ^ Ramachandran 2014, p. 268. ^ The Times of India Directory and Year Book Including Who's who. Bennett Coleman & Co. Ltd. 1984. p. 234. ^ \"Birthday exclusive: Superstar Rajinikanth\". Deccan Chronicle. 12 December 2012. slide 24. Archived from the original on 12 December 2012. ^ \"Raksha Bandhan special: \"Thangachi paasam\" An evergreen \"hit\" mantra!\". Sify. 7 August 2017. Archived from the original on 12 September 2019. Retrieved 12 September 2019. ^ Saraswathi, S. (27 August 2015). \"40 years of Rajinikanth\". Rediff.com. Archived from the original on 6 September 2015. Retrieved 21 October 2015. ^ Mahendran 2013, pp. 136–138. ^ Balamurugan, K. (22 May 2007). \"Rajni's Tamil Top 10\". Rediff.com. Archived from the original on 25 November 2013. Retrieved 25 November 2013. ^ \"Top 12 Rajinikanth movies – 05\". The Times of India. 10 December 2013. Archived from the original on 10 December 2013. Retrieved 10 December 2013. ^ Suganth, M. (26 July 2015). \"Panchu Arunachalam is the man who invented Rajinikanth as an actor\". The Times of India. Archived from the original on 26 July 2015. Retrieved 26 July 2015. ^ Narayan, Anantha (9 May 2014). \"Many names of Rajinikanth\". Indulge Express. Indian Express Limited. Archived from the original on 21 August 2014. Retrieved 20 August 2014. ^ Subhakeerthana, S. (10 January 2019). \"Petta review: More celebration, less film\". The Indian Express. Archived from the original on 10 January 2019. Retrieved 10 January 2019. ^ Balachandran, Logesh (4 October 2015). \"Ketta Payyan sir, indha Kabali\". The Times of India. Archived from the original on 4 October 2015. Retrieved 4 October 2015. ^ Mathevan, Santhosh (15 August 2018). \"'Mullum Malarum' stays fresh in mind even after 40 years\". News Today. Archived from the original on 19 September 2019. Retrieved 19 September 2019. ^ Karthikeyan, D. (15 July 2011). \"Three gems who changed the course of cinema\". The Hindu. Archived from the original on 20 September 2015. Retrieved 19 September 2019. ^ வாசுதேவன், கார்த்திகா (3 June 2017). \"அன்னக்கிளியில் தொடங்கி ஆறாயிரம் பாடல்கள் தாண்டிய தெய்வீக இசைக்கு பிறந்தநாள் வாழ்த்துகள்!\" [Happy Birthday to the Divine Music which began in Annakkili and crossed six thousand songs!]. Dinamani (in Tamil). p. 2. Archived from the original on 19 September 2019. Retrieved 19 September 2019. ^ Rangan, Baradwaj (10 January 2019). \"Petta Movie Review: A Treat For Fans Of The Star Makes You Wish It Had Also Been One For Fans Of The Director\". Film Companion. Archived from the original on 29 January 2023. Retrieved 19 August 2019. ^ Thirumurthy, Priyanka (15 January 2019). \"From \"Mullum Malarum\" to 'Kabali': All the Rajini film references we spotted in \"Petta\"\". The News Minute. Archived from the original on 19 August 2019. Retrieved 19 August 2019. Bibliography[edit] Dhananjayan, G. (2014). Pride of Tamil Cinema: 1931–2013. Blue Ocean Publishers. OCLC 898765509. Dharap, B. V. (1977). Indian Films. Motion Picture Enterprises. Krissna, Suresh; Rangarajan, Malathi (2012). My Days with Baasha: The Rajnikanth Phenomenon. Westland Ltd. ISBN 978-93-8162-629-0. Mahendran (2013) [2004]. Cinemavum Naanum [Cinema and I] (in Tamil). Karpagam Publications. OCLC 54777094. Rajadhyaksha, Ashish; Willemen, Paul (1998) [1994]. Encyclopaedia of Indian Cinema. British Film Institute and Oxford University Press. ISBN 0-19-563579-5. Rajanayagam, S. (2015). Popular Cinema and Politics in South India: The Films of MGR and Rajinikanth. Routledge. ISBN 978-1-138-82203-0. Ramachandran, Naman (2014) [2012]. Rajinikanth: The Definitive Biography. Penguin Books. ISBN 978-0-14-342111-5. Sundararaman (2007) [2005]. Raga Chintamani: A Guide to Carnatic Ragas Through Tamil Film Music (2nd ed.). Pichhamal Chintamani. OCLC 295034757. Thoraval, Yves (2000). The cinemas of India. Macmillan India. ISBN 978-0-333-93410-4. External links[edit] Mullum Malarum at IMDb Mullum Malarum at Rotten Tomatoes vteFilms directed by Mahendran Mullum Malarum (1978) Uthiripookkal (1979) Poottaatha Poottukkal (1980) Johnny (1980) Nenjathai Killathe (1980) Nandu (1981) Metti (1982) Azhagiya Kanne (1982) Kai Kodukkum Kai (1984) Kannukku Mai Ezhuthu (1986) Oor Panchayathu (1992) Sasanam (2006) vteFilmfare Award for Best Tamil Film Naanum Oru Penn (1964) Server Sundaram (1965) Thiruvilaiyadal (1966) Ramu (1967) Karpooram (1968) Lakshmi Kalyanam (1969) Adimai Penn (1970) Engirundho Vandhaal (1971) Babu (1972) Pattikada Pattanama (1973) Bharatha Vilas (1974) Dikkatra Parvathi (1975) Apoorva Raagangal (1976) Annakili (1977) Bhuvana Oru Kelvi Kuri (1978) Mullum Malarum (1979) Pasi (1980) Varumayin Niram Sivappu (1981) Thanneer Thanneer (1982) Enkeyo Ketta Kural (1983) Mann Vasanai (1984) Achamillai Achamillai (1985) Sindhu Bhairavi (1986) Samsaram Adhu Minsaram (1987) Vedham Pudhithu (1988) Agni Natchathiram (1989) Apoorva Sagodharargal (1990) Pudhu Vasantham (1991) Chinna Thambi (1992) Roja (1993) Gentleman (1994) Karuthamma (1995) Bombay (1996) Indian (1997) Bharathi Kannamma (1998) Natpukkaga (1999) Sethu (2000) Kandukondain Kandukondain (2001) Aanandham (2002) Azhagi (2003) Pithamagan (2004) Autograph (2005) Anniyan (2006) Veyil (2007) Paruthiveeran (2008) Subramaniapuram (2009) Naadodigal (2010) Mynaa (2011) Aadukalam (2012) Vazhakku Enn 18/9 (2013) Thanga Meenkal (2014) Kaththi (2015) Kaaka Muttai (2016) Joker (2017) Aramm (2018) Pariyerum Perumal (2019) Jai Bhim (2020-2021) vteTamil Nadu State Film Award for Best Film1967– 79First prize Kaavalkaaran (1967) Uyarndha Manithan (1968) Adimai Penn (1969) Vietnam Veedu (1970) No Award (1971–1976) 16 Vayathinile (1977) Mullum Malarum (1978) Pasi (1979) Second prize Aalayam (1967) Thillana Mohanambal (1968) Akka Thangai (1969) Engal Thangam (1970) No Award (1971–1976) Madhurageetham (1977) Aval Appadithan (1978) Puthiya Vaarpugal (1979) Third prize Bama Vijayam (1967) Thamarai Nenjam (1968) Deiva Magan (1969) Namma Kuzhandaigal (1970) No Award (1971–1976) Bala Pareetchai (1977) Ilamai Oonjal Aadukirathu (1978) Thisai Maariya Paravaigal (1979) 1980– 89First prize Varumayin Niram Sivappu (1980) Alaigal Oivathillai (1981) Enkeyo Ketta Kural (1982) No Award (1983–1987) Poo Pootha Nandavanam (1988) Pudhea Paadhai (1989) Second prize Nenjathai Killathe (1980) Keezh Vaanam Sivakkum (1981) Agni Sakshi (1982) No Award (1983–1987) Paasa Paravaigal (1988) Pudhu Pudhu Arthangal (1989) Third prize Vandichakkaram (1980) Moondram Pirai (1981) Ezhavathu Manithan (1982) No Award (1983–1987) Agni Natchathiram (1988) Nyaya Tharasu (1989) 1990– 99First prize Pudhu Vasantham (1990) Chinna Thambi (1991) Roja (1992) Jaathi Malli (1993) Nattamai (1994) Anthimanthaarai (1995) Indian (1996) Arunachalam & Surya Vamsam (1997) Natpukkaga (1998) Padayappa (1999) Second prize Keladi Kannmanii (1990) En Rasavin Manasile (1991) Thevar Magan (1992) Pathini Penn (1993) Nammavar (1994) Kolangal (1995) Kadhal Kottai (1996) Porkkaalam (1997) Maru Malarchi (1998) Thullatha Manamum Thullum (1999) Third prize Kizhakku Vaasal (1990) Gunaa (1991) Chinna Gounder (1992) Gokulam (1993) Pavithra (1994) Avatharam (1995) Purushan Pondatti (1996) Arasiyal (1997) Unnidathil Ennai Koduthen (1998) Ethirum Puthirum (1999) 2000– 09First prize Vaanathaippola (2000) Virumbugiren (2001) Ramanaa (2002) Eera Nilam (2003) Autograph (2004) Chandramukhi & Ghajini (2005) Veyil (2006) Sivaji: The Boss (2007) Dasavathaaram (2008) Pasanga (2009) Second prize Vaanavil (2000) Pandavar Bhoomi (2001) Kannathil Muthamittal (2002) Power of Women (2003) Vishwa Thulasi (2004) Anniyan (2005) Paruthiveeran (2006) Mozhi (2007) Abhiyum Naanum (2008) Mayandi Kudumbathar (2009) Third prize Vetri Kodi Kattu (2000) Aanandham (2001) Unnai Ninaithu (2002) Parthiban Kanavu (2003) Kannadi Pookal (2004) Thavamai Thavamirundhu (2005) Thiruttu Payale (2006) Pallikoodam (2007) Santosh Subramaniam (2008) Achchamundu! Achchamundu! (2009) 2010– 15First prize Mynaa (2010) Vaagai Sooda Vaa (2011) Vazhakku Enn 18/9 (2012) Ramanujan (2013) Kuttram Kadithal (2014) Thani Oruvan (2015) Second prize Kalavani (2010) Deiva Thirumagal (2011) Saattai (2012) Thanga Meenkal (2013) Goli Soda (2014) Pasanga 2 (2015) Third prize Puthran (2010) Uchithanai Muharnthaal (2011) Dhoni (2012) Pannaiyarum Padminiyum (2013) Nimirndhu Nil (2014) Prabha (2015) Portals: Film India Retrieved from \"https://en.wikipedia.org/w/index.php?title=Mullum_Malarum&oldid=1306035758\" Categories: 1978 films1970s Indian films1970s Tamil-language films1978 directorial debut films1978 drama filmsFilms about orphansFilms about siblingsFilms based on Tamil novelsFilms directed by Mahendran (filmmaker)Films scored by IlaiyaraajaFilms shot in KarnatakaFilms shot in OotyFilms with screenplays by Mahendran (filmmaker)Indian drama filmsTamil films remade in other languagesTamil-language Indian filmsHidden categories: CS1 Tamil-language sources (ta)CS1: unfit URLArticles with short descriptionShort description is different from WikidataGood articlesUse Indian English from October 2021All Wikipedia articles written in Indian EnglishUse dmy dates from October 2021Template film date with 1 release datePages with Tamil IPA Search Search Mullum Malarum 3 languages Add topic",
    "word_count": 6163
  },
  "summary": {
    "summary": "It won the Filmfare Award for Best Film – Tamil, the Tamil Nadu State Film Award for Best Film and Rajinikanth won the Tamil Nadu State Film Award Special Prize for his performance. Archived from the original on 26 July 2015. Archived from the original on 14 July 2019. Archived from the original on 30 August 2018. Archived from the original on 2 November 2013. Archived from the original on 5 July 2015. Archived from the original on 4 April 2019. Archived from the original on 29 April 2019. Archived from the original on 9 December 2015. Archived from the original on 16 December 2013. Archived from the original on 22 November 2013. Archived from the original on 7 April 2019. Archived from the original on 2 December 2013. Archived from the original on 14 August 2013. Archived from the original on 3 August 2021. Archived from the original on 1 September 2019. Archived from the original on 12 September 2019. Archived from the original on 5 April 2019. Archived from the original on 17 December 2013. Archived from the original on 6 September 2015. Archived from the original on 25 November 2013. Archived from the original on 10 December 2013. Archived from the original on 21 August 2014. Archived from the original on 4 October 2015. Archived from the original on 19 September 2019. Archived from the original on 20 September 2015. Archived from the original on 19 August 2019.",
    "key_concepts": [
      "Film",
      "End",
      "Mahendra",
      "Mahendran",
      "Man",
      "Original",
      "Tamil",
      "Mullu",
      "Archived",
      "Retrieved",
      "Mullum",
      "Malarum"
    ],
    "method": "nltk_extractive"
  },
  "mind_maps": {
    "visual": "\n                           ╔══════════════════════════════╗\n                           ║  MULLUM MALARUM - WIKIPEDIA  ║\n                           ╚══════════════════════════════╝\n\n                                        │\n                                   ┌─────┴─────┐\n                                   │           │\n├── 📌 Film                         │                        📌 Tamil ──┤\n├── 📌 End                          │                        📌 Mullu ──┤\n├── 📌 Mahendra                     │                     📌 Archived ──┤\n├── 📌 Mahendran                    │                    📌 Retrieved ──┤\n├── 📌 Man                          │                       📌 Mullum ──┤\n├── 📌 Original                     │                      📌 Malarum ──┤\n\n┌──────────────────────────────────────────────────────────────────────────────┐\n│                                   SUMMARY                                    │\n├──────────────────────────────────────────────────────────────────────────────┤\n│ It won the Filmfare Award for Best Film – Tamil, the Tamil Nadu State Film  │\n│ Award for Best Film and Rajinikanth won the Tamil Nadu State Film Award     │\n│ Special Prize for his performance. Archived from the original on 26 July    │\n│ 2015. Archived from the original on 14 July 2019. Archived from the         │\n│ original on 30 August 2018. Archived from the original on 2 November 2013.  │\n│ Archived from the original on 5 July 2015. Archived from the original on 4  │\n│ April 2019. Archived from the original on 29 April 2019. Archived from the  │\n│ original on 9 December 2015. Archived from the original on 16 December      │\n│ 2013. Archived from the original on 22 November 2013. Archived from the     │\n│ original on 7 April 2019. Archived from the original on 2 December 2013.    │\n│ Archived from the original on 14 August 2013. Archived from the original    │\n│ on 3 August 2021. Archived from the original on 1 September 2019. Archived  │\n│ from the original on 12 September 2019. Archived from the original on 5     │\n│ April 2019. Archived from the original on 17 December 2013. Archived from   │\n│ the original on 6 September 2015. Archived from the original on 25          │\n│ November 2013. Archived from the original on 10 December 2013. Archived     │\n│ from the original on 21 August 2014. Archived from the original on 4        │\n│ October 2015. Archived from the original on 19 September 2019. Archived     │\n│ from the original on 20 September 2015. Archived from the original on 19    │\n│ August 2019.                                                                │\n└──────────────────────────────────────────────────────────────────────────────┘",
    "network": "\n╔════════════════════════════════════════════════════════════╗\n║                      NETWORK MIND MAP                      ║\n╠════════════════════════════════════════════════════════════╣\n║                 Mullum Malarum - Wikipedia                 ║\n╚════════════════════════════════════════════════════════════╝\n\n        🔵 Mullum Malarum - Wikipedia\n        │\n   ┌────┴────┐\n   │         │\n   ├─ 🔸 Film\n   │         └─ 🔸 End\n   │         │\n   ├─ 🔸 Mahendra\n   │         └─ 🔸 Mahendran\n   │         │\n   ├─ 🔸 Man\n   │         └─ 🔸 Original\n   │         │\n   ├─ 🔸 Tamil\n   │         └─ 🔸 Mullu\n   │\n   └─ 🔸 ... and more concepts",
    "hierarchical": "\n🌳 MULLUM MALARUM - WIKIPEDIA\n│\n├── 🌿 Film\n├── 🌿 End\n├── 🌿 Mahendra\n├── 🌿 Mahendran\n├── 🌿 Man\n├── 🌿 Original\n├── 🌿 Tamil\n├── 🌿 Mullu\n├── 🌿 Archived\n├── 🌿 Retrieved\n├── 🌿 Mullum\n└── 🌿 Malarum"
  }
}