{
  "scraped_content": {
    "url": "https://emedicine.medscape.com/article/889259-overview?form=fpf",
    "title": "Pediatric Allergic Rhinitis: Background, Epidemiology, Nasal Function and Anatomy",
    "full_text": "Pediatric Allergic Rhinitis: Background, Epidemiology, Nasal Function and Anatomy close Please confirm that you would like to log out of Medscape. If you log out, you will be required to enter your username and password the next time you visit. Log out Cancel processing.... Tools & Reference>Pediatrics: General Medicine Pediatric Allergic Rhinitis Updated: Aug 06, 2025 Author: Jack M Becker, MD; Chief Editor: Harumi Jyonouchi, MD more... Share Print Feedback Close Facebook Twitter LinkedIn WhatsApp Email Sections Pediatric Allergic Rhinitis Sections Pediatric Allergic Rhinitis Overview Background Epidemiology Nasal Function and Anatomy Etiology Pathophysiology Prognosis Show All Presentation History Physical Examination Complications Show All DDx Workup Approach Considerations Laboratory Studies Other Tests Procedures Show All Treatment Approach Considerations Environmental Control Measures Allergen-Specific Immunotherapy Pharmacologic Treatment Prevention Show All Guidelines Medication Corticosteroids, Intranasal Antihistamines, 2nd Generation Antihistamines, Intranasal Leukotriene Receptor Antagonists Mast Cell Stabilizers, Intranasal Decongestants, Intranasal Allergy, Intranasal Allergen Immunotherapy Show All Media Gallery References Overview Background Allergic rhinitis is a common, debilitating disease that affects both children and adults. It is an immunoglobulin E (IgE)–mediated reaction to allergens like dust mites, pet dander, cockroaches, molds, and pollens. Symptoms include sneezing, nasal congestion, rhinorrhea, cough, itching, sinus pressure, headache, and epistaxis. Although not life-threatening, allergic rhinitis can significantly impair quality of life and daily functioning. In children, it may contribute to sleep disturbances, poor school performance, and behavioral issues. [1] In adults, it can reduce workplace productivity by as much as 10%, though appropriate treatment may reduce this impact to around 3%. [2] The \"one airway hypothesis\" states that upper and lower airway inflammation are linked, meaning asthma and allergic rhinitis often co-occur. [3] Untreated allergic rhinitis in asthmatics increases ED visits by nearly twofold and hospitalizations by almost threefold. [4] Next: Epidemiology In the United States, the prevalence of allergic rhinitis in children is estimated at 10% to 20%. [5] One national survey reported rates as high as 38% when based on any symptom occurrence, but prevalence dropped to 17% when symptoms were required to persist longer than 31 days. [6] Similar rates are seen in temperate regions of Europe and Asia. Allergic rhinitis often begins in early childhood. Sensitization to indoor allergens such as dust mites, pet dander, mold, and cockroach particles may occur before 2 years old, particularly with high exposure. Sensitization to outdoor allergens typically emerges after age 3–5 years. Symptoms tend to increase with age, peaking in adolescence or early adulthood, and may decrease later in life. In the PARIS cohort, 9.1% of toddlers showed allergic rhinitis–like symptoms by 18 months of age. [7] There is no clear sex or racial predilection in allergic rhinitis. However, children from non-White backgrounds may be less likely to receive a diagnosis or seek treatment. [8] Prevalence is generally higher in urban and suburban settings compared to rural areas. Allergic rhinitis frequently coexists with other atopic conditions, particularly asthma and atopic dermatitis. [1, 3] Children with allergic rhinitis are at increased risk of developing asthma, and early-onset rhinitis may precede asthma symptoms. Conjunctivitis is also common and may occur concurrently. Recognizing these associations is important for early diagnosis and comprehensive management of atopic disease in pediatric patients. Interestingly, some studies demonstrate that living with multiple pets in the first few years of life decreases the risk of asthma and allergies. [9] Previous Next: Nasal Function and Anatomy The nose filters, humidifies, and regulates the temperature of inspired air using a large surface area created by three turbinates in each nostril. Airflow resistance is affected by mucosal blood flow, which alters turbinate size. Nasal defenses include mucus, cilia, and vibrissae that trap inhaled particles. While irritants such as cigarette smoke or cold air may cause short-term rhinitis, allergens can trigger a more sustained immune response. Commonly, one nostril is slightly more obstructed than the other due to the nasal cycle, a normal physiological process where the turbinates in each nostril swell and shrink in an alternating pattern. This alternates the dominant side of airflow every few hours. [10] Previous Next: Etiology Allergic rhinitis symptoms arise from exposure to environmental allergens, which can be classified as perennial (year-round) or seasonal. Perennial allergens are typically indoor and include: Dust mites Cat dander Dog dander Indoor molds Cockroaches Feathers (usually allergenic due to dust mite contamination in feather bedding) Other furry animals Nonwashable bedding, such as pillows and mattresses, often harbors dust mites, which reproduce every three weeks and thrive where human dander accumulates. Dust mite–proof encasings are recommended to reduce exposure. Seasonal allergens are airborne and generally outdoor, with peak levels in late afternoon and early morning. These include: Tree pollen Grass pollen Weed pollen (note: flowers do not cause allergic rhinitis because they rely on insect pollination, not wind) Outdoor mold spores Previous Next: Pathophysiology Allergic rhinitis is an IgE-mediated hypersensitivity reaction to environmental allergens. Sensitization requires repeated exposure, which rarely occurs before age 2 years for indoor allergens and typically begins after age 3–5 years for outdoor allergens. The average age at presentation is 9–10 years. [6] Once sensitized, allergen exposure causes cross-linking of allergen-specific IgE on the surface of mast cells. This leads to degranulation and the release of inflammatory mediators such as histamine, prostaglandin D2, leukotrienes, tryptase, heparin, and various cytokines. [11, 12] These mediators produce two phases of response: Immediate-phase symptoms include nasal itching, sneezing, clear rhinorrhea, and congestion Late-phase response occurs hours later due to recruitment of eosinophils and basophils that release additional inflammatory mediators, prolonging symptoms In highly sensitive individuals, repeated exposure can lead to nasal priming. [12] The mucosa becomes hyperresponsive and reacts to even small amounts of allergen or nonspecific triggers. Previous Next: Prognosis Allergic rhinitis is not associated with mortality, but it causes significant morbidity and impairs quality of life. Patients often report symptoms such as nasal congestion, sneezing, and poor sleep that interfere with daily activities. Quality-of-life studies have shown that individuals with moderate to severe allergic rhinitis rate their impairment as comparable to that experienced by patients with moderate to severe asthma. In children, allergic rhinitis is a leading cause of missed school days, with an estimated 824,000 school days lost annually in the United States. [13] In addition, more than 4 million days of reduced function are reported each year due to allergic rhinitis–related symptoms. [13] The condition is also strongly associated with comorbid atopic and upper airway disorders, including asthma, atopic dermatitis, sinusitis, and otitis media. [1] Most patients can manage symptoms effectively with intermittent or continuous pharmacotherapy. Allergen immunotherapy is the only intervention that can modify the disease course, though symptoms often recur 2–3 years after discontinuation, typically with reduced severity. [14] A small percentage of children improve during adolescence, but many experience a recurrence in early adulthood. Symptoms usually diminish by the fifth decade of life. The economic burden of allergic rhinitis is substantial. Although data currently available are limited, the latest estimates put US self-treatment spending at about $56 per year per patient, global prescription costs above $6 billion, and indirect productivity losses near $1.5 billion. [15] Previous Clinical Presentation References Hossny E, Adachi Y, Anastasiou E, et al. Pediatric asthma comorbidities: Global impact and unmet needs. World Allergy Organ J. 2024 May. 17 (5):100909. [QxMD MEDLINE Link]. Meltzer EO. Productivity costs of antihistamines in the workplace. Occup Health Saf. 1996 Aug. 65(8):46-50. [QxMD MEDLINE Link]. Stern J, Chen M, Fagnano M, Halterman JS. Allergic rhinitis co-morbidity on asthma outcomes in city school children. J Asthma. 2023 Feb. 60 (2):255-261. [QxMD MEDLINE Link]. Crystal-Peters J, Neslusan C, Crown WH, Torres A. Treating allergic rhinitis in patients with comorbid asthma: the risk of asthma-related hospitalizations and emergency department visits. J Allergy Clin Immunol. 2002 Jan. 109(1):57-62. [QxMD MEDLINE Link]. Gendo K, Larson EB. Evidence-based diagnostic strategies for evaluating suspected allergic rhinitis. Ann Intern Med. 2004 Feb 17. 140(4):278-89. [QxMD MEDLINE Link]. Meltzer EO, Blaiss MS, Derebery MJ, Mahr TA, Gordon BR, Sheth KK, et al. Burden of allergic rhinitis: results from the Pediatric Allergies in America survey. J Allergy Clin Immunol. 2009 Sep. 124 (3 Suppl):S43-70. [QxMD MEDLINE Link]. Herr M, Clarisse B, Nikasinovic L, et al. Does allergic rhinitis exist in infancy? Findings from the PARIS birth cohort. Allergy. 2011 Feb. 66(2):214-21. [QxMD MEDLINE Link]. Davis CM, Apter AJ, Casillas A, Foggs MB, Louisias M, Morris EC, et al. Health disparities in allergic and immunologic conditions in racial and ethnic underserved populations: A Work Group Report of the AAAAI Committee on the Underserved. J Allergy Clin Immunol. 2021 May. 147 (5):1579-1593. [QxMD MEDLINE Link]. Hesselmar B, Hicke-Roberts A, Lundell AC, Adlerberth I, Rudin A, Saalman R, et al. Pet-keeping in early life reduces the risk of allergy in a dose-dependent fashion. PLoS One. 2018. 13 (12):e0208472. [QxMD MEDLINE Link]. Kahana-Zweig R, Geva-Sagiv M, Weissbrod A, Secundo L, Soroker N, Sobel N. Measuring and Characterizing the Human Nasal Cycle. PLoS One. 2016. 11 (10):e0162918. [QxMD MEDLINE Link]. [Guideline] Dykewicz MS, Wallace DV, Amrol DJ, et al. Rhinitis 2020: A practice parameter update. J Allergy Clin Immunol. 2020 Oct. 146 (4):721-767. [QxMD MEDLINE Link]. Greiner AN, Hellings PW, Rotiroti G, Scadding GK. Allergic rhinitis. Lancet. 2011 Dec 17. 378 (9809):2112-22. [QxMD MEDLINE Link]. Malone DC, Lawson KA, Smith DH, Arrighi HM, Battista C. A cost of illness study of allergic rhinitis in the United States. J Allergy Clin Immunol. 1997 Jan. 99(1 Pt 1):22-7. [QxMD MEDLINE Link]. Fritszching B, Porsbjerg C, Buchs S, Larsen JR, Freemantle N, Contoli M. High baseline prevalence of atopic comorbidities and medication use in children treated with allergy immunotherapy in the REAl-world effeCtiveness in allergy immunoTherapy (REACT) study. Front Pediatr. 2023. 11:1136942. [QxMD MEDLINE Link]. Meltzer EO, Bukstein DA. The economic impact of allergic rhinitis and current guidelines for treatment. Ann Allergy Asthma Immunol. 2011 Feb. 106 (2 Suppl):S12-6. [QxMD MEDLINE Link]. Simons FE. Learning impairment and allergic rhinitis. Allergy Asthma Proc. 1996 Jul-Aug. 17 (4):185-9. [QxMD MEDLINE Link]. Alessandri C, Ferrara R, Bernardi ML, Zennaro D, Tuppo L, Giangrieco I, et al. Molecular approach to a patient's tailored diagnosis of the oral allergy syndrome. Clin Transl Allergy. 2020. 10:22. [QxMD MEDLINE Link]. Hatzler L, Panetta V, Lau S, Wagner P, Bergmann RL, Illi S, et al. Molecular spreading and predictive value of preclinical IgE response to Phleum pratense in children with hay fever. J Allergy Clin Immunol. 2012 Jul 25. [QxMD MEDLINE Link]. Satyaraj E, Li Q, Sun P, Sherrill S. Anti-Fel d1 immunoglobulin Y antibody-containing egg ingredient lowers allergen levels in cat saliva. J Feline Med Surg. 2019 Oct. 21 (10):875-881. [QxMD MEDLINE Link]. Dykewicz MS, Wallace DV, Baroody F, Bernstein J, Craig T, et al. Treatment of seasonal allergic rhinitis: An evidence-based focused 2017 guideline update. Ann Allergy Asthma Immunol. 2017 Nov 2. [QxMD MEDLINE Link]. [Guideline] Seidman MD, Gurgel RK, Lin SY, Schwartz SR, Baroody FM, et al. Clinical practice guideline: Allergic rhinitis. Otolaryngol Head Neck Surg. 2015 Feb. 152 (1 Suppl):S1-43. [QxMD MEDLINE Link]. Lynch SV, Wood RA, Boushey H, Bacharier LB, Bloomberg GR, Kattan M, et al. Effects of early-life exposure to allergens and bacteria on recurrent wheeze and atopy in urban children. J Allergy Clin Immunol. 2014 May 28. [QxMD MEDLINE Link]. Chalmers JR, Haines RH, Bradshaw LE, Montgomery AA, Thomas KS, Brown SJ, et al. Daily emollient during infancy for prevention of eczema: the BEEP randomised controlled trial. Lancet. 2020 Mar 21. 395 (10228):962-972. [QxMD MEDLINE Link]. Söderström L, Lilja G, Borres MP, Nilsson C. An explorative study of low levels of allergen-specific IgE and clinical allergy symptoms during early childhood. Allergy. 2011 Aug. 66(8):1058-64. [QxMD MEDLINE Link]. Cox LS, Larenas Linnemann D, Nolte H, Weldon D, Finegold I, Nelson HS. Sublingual immunotherapy: a comprehensive review. J Allergy Clin Immunol. 2006 May. 117(5):1021-35. [QxMD MEDLINE Link]. FDA OKs Oralair, First US Sublingual Allergy Immunotherapy. Medscape. Available athttps://www.medscape.com/viewarticle/822975. Accessed: April 4, 2014. Grastek [package insert]. Whitehouse Station, NJ: Merck & Co, Inc. April 2014. Available at [Full Text]. Maloney J, Bernstein DI, Nelson H, Creticos P, Hébert J, Noonan M, et al. Efficacy and safety of grass sublingual immunotherapy tablet, MK-7243: a large randomized controlled trial. Ann Allergy Asthma Immunol. 2014 Feb. 112(2):146-153.e2. [QxMD MEDLINE Link]. Hand L. First-year allergen exposures may reduce later risks. Medscape Medical News. June 11, 2014. [Full Text]. Media Gallery of 2 Tables Back to List Contributor Information and Disclosures Author Jack M Becker, MD Clinical Associate Professor of Pediatrics, Drexel University College of MedicineJack M Becker, MD is a member of the following medical societies: American Academy of Allergy Asthma and Immunology, American Academy of Pediatrics, American College of Allergy, Asthma and ImmunologyDisclosure: Nothing to disclose. Specialty Editor Board Mary L Windle, PharmD Adjunct Associate Professor, University of Nebraska Medical Center College of Pharmacy; Editor-in-Chief, Medscape Drug ReferenceDisclosure: Nothing to disclose. Chief Editor Harumi Jyonouchi, MD Faculty, Division of Allergy/Immunology and Infectious Diseases, Department of Pediatrics, Saint Peter's University HospitalHarumi Jyonouchi, MD is a member of the following medical societies: American Academy of Allergy Asthma and Immunology, American Academy of Pediatrics, American Association of Immunologists, American Medical Association, Clinical Immunology Society, New York Academy of Sciences, Society for Experimental Biology and Medicine, Society for Pediatric Research, Society for Mucosal ImmunologyDisclosure: Nothing to disclose. Additional Contributors C Lucy Park, MD Chief, Division of Allergy, Immunology, and Pulmonology, Associate Professor, Department of Pediatrics, University of Illinois at Chicago College of MedicineC Lucy Park, MD is a member of the following medical societies: American Academy of Allergy Asthma and Immunology, Chicago Medical Society, American Medical Association, Clinical Immunology Society, Illinois State Medical SocietyDisclosure: Nothing to disclose. Acknowledgements John Wilson Georgitis, MD Consulting Staff, Lafayette Allergy Services John Wilson Georgitis, MD is a member of the following medical societies: American Academy of Allergy Asthma and Immunology, American Academy of Pediatrics, American Association for the Advancement of Science, American College of Chest Physicians, American Lung Association, American Medical Writers Association, and American Thoracic Society Disclosure: Nothing to disclose. Close What would you like to print? What would you like to print? Print this section Print the entire contents of Print the entire contents of article Sections Pediatric Allergic Rhinitis Overview Background Epidemiology Nasal Function and Anatomy Etiology Pathophysiology Prognosis Show All Presentation History Physical Examination Complications Show All DDx Workup Approach Considerations Laboratory Studies Other Tests Procedures Show All Treatment Approach Considerations Environmental Control Measures Allergen-Specific Immunotherapy Pharmacologic Treatment Prevention Show All Guidelines Medication Corticosteroids, Intranasal Antihistamines, 2nd Generation Antihistamines, Intranasal Leukotriene Receptor Antagonists Mast Cell Stabilizers, Intranasal Decongestants, Intranasal Allergy, Intranasal Allergen Immunotherapy Show All Media Gallery References encoded search term (Pediatric Allergic Rhinitis) and Pediatric Allergic Rhinitis What to Read Next on Medscape Related Conditions and Diseases Allergic Rhinitis Pediatric Allergic Rhinitis Identifying and Managing Allergic Rhinitis in the Asthma Population Fast Five Quiz: Test Your Knowledge About Fall Allergies Fast Five Quiz: Allergy Triggers Rapid Rx Quiz Treating Rhinitis Pharmacotherapy for Nonallergic Rhinitis News & Perspective Meta-Analysis Examines the Efficacy of Intranasal Medications for Allergic Rhinitis in Children Asthma Amplifies Allergic Rhinitis Burden in Children Managing Pediatric Allergic Rhinitis in Primary Care: When to Refer Immunotherapy for Allergic Rhinitis and Asthma Has Lasting Effects Combined Intranasal Allergic Rhinitis Treatment Better Than Monotherapy New Nasal Spray Approved for Nasal and Ocular Seasonal Allergic Rhinitis Tools Drug Interaction Checker Pill Identifier Calculators Formulary Slideshow All About Allergies: Be Ready for Spring Recommended 2002 889259-overview Diseases & Conditions Diseases & Conditions Pediatric Allergic Rhinitis 2003 /viewarticle/1001884 Managing Eosinophilic Esophagitis: Take the Case Challenge 0.75 CME / CE / ABIM MOC Credits You are being redirected to Medscape Education Yes, take me there 0.75 CME / CE / ABIM MOC Managing Eosinophilic Esophagitis: Take the Case Challenge 2010 astelin-nasal-spray-astepro-azelastine-343414 Drugs Drugs azelastine 2010 patanase-olopatadine-intranasal-999491 Drugs Drugs olopatadine intranasal",
    "word_count": 2612,
    "sections": [],
    "hierarchy_root": {
      "title": "Pediatric Allergic Rhinitis: Background, Epidemiology, Nasal Function and Anatomy",
      "level": 0,
      "content": "",
      "subsections": [],
      "links": [],
      "children": []
    },
    "links": [],
    "images": []
  },
  "summary": {
    "summary": "- Pediatric Allergic Rhinitis: Background, Epidemiology, Nasal Function and Anatomy close Please confirm that you would like to log out of Medscape.\n- Although not life-threatening, allergic rhinitis can significantly impair quality of life and daily functioning.\n- [4] Next: Epidemiology In the United States, the prevalence of allergic rhinitis in children is estimated at 10% to 20%.\n- Allergic rhinitis often begins in early childhood.\n- The economic burden of allergic rhinitis is substantial.\n- Burden of allergic rhinitis: results from the Pediatric Allergies in America survey.\n- Does allergic rhinitis exist in infancy?\n- Rhinitis 2020: A practice parameter update.\n- Learning impairment and allergic rhinitis.\n- Clinical practice guideline: Allergic rhinitis.",
    "summary_bullets": [
      "Pediatric Allergic Rhinitis: Background, Epidemiology, Nasal Function and Anatomy close Please confirm that you would like to log out of Medscape.",
      "Although not life-threatening, allergic rhinitis can significantly impair quality of life and daily functioning.",
      "[4] Next: Epidemiology In the United States, the prevalence of allergic rhinitis in children is estimated at 10% to 20%.",
      "Allergic rhinitis often begins in early childhood.",
      "The economic burden of allergic rhinitis is substantial.",
      "Burden of allergic rhinitis: results from the Pediatric Allergies in America survey.",
      "Does allergic rhinitis exist in infancy?",
      "Rhinitis 2020: A practice parameter update.",
      "Learning impairment and allergic rhinitis.",
      "Clinical practice guideline: Allergic rhinitis."
    ],
    "key_concepts": [
      "Rhinitis",
      "Allergic",
      "Allergy",
      "Nasal",
      "Link",
      "Pediatr",
      "Medline",
      "Qxmd",
      "Pediatric",
      "Asthma",
      "Immunol",
      "Allergen",
      "America",
      "American",
      "Clin"
    ],
    "method": "nltk_extractive_bullets"
  },
  "mind_maps": {
    "visual": "\n╔═════════════════════════════════════════════════════════════════════════════════════╗\n║ PEDIATRIC ALLERGIC RHINITIS: BACKGROUND, EPIDEMIOLOGY, NASAL FUNCTION AND ANATOMY ║\n╚═════════════════════════════════════════════════════════════════════════════════════╝\n\n                                        │\n                                   ┌─────┴─────┐\n├── 🔹 Rhinitis                      │\n│                                   ├── 🔹 Allergic\n├── 🔹 Allergy                       │\n│                                   ├── 🔹 Nasal\n├── 🔹 Link                          │\n│                                   ├── 🔹 Pediatr\n├── 🔹 Medline                       │\n│                                   ├── 🔹 Qxmd",
    "network": "🌐 Pediatric Allergic Rhinitis: Background, Epidemiology, Nasal Function and Anatomy\n│\n├── 📊 Key Concepts\n│ ├── 🔸 Rhinitis\n│ ├── 🔸 Allergic\n│ ├── 🔸 Allergy\n│ ├── 🔸 Nasal\n│ ├── 🔸 Link\n│ ├── 🔸 Pediatr",
    "hierarchical": "🌳 Pediatric Allergic Rhinitis: Background, Epidemiology, Nasal Function and Anatomy\n│\n├── 🍃 Rhinitis\n├── 🍃 Allergic\n├── 🍃 Allergy\n├── 🍃 Nasal\n├── 🍃 Link\n├── 🍃 Pediatr\n├── 🍃 Medline\n├── 🍃 Qxmd\n├── 🍃 Pediatric\n├── 🍃 Asthma\n├── 🍃 Immunol\n├── 🍃 Allergen\n├── 🍃 America\n├── 🍃 American\n└── 🍃 Clin"
  },
  "interactive_mindmap": {
    "root_node": {
      "id": "node_1_db170671",
      "title": "Pediatric Allergic Rhinitis: Background, Epidemiology, Nasal Function and Anatomy",
      "content": "- Pediatric Allergic Rhinitis: Background, Epidemiology, Nasal Function and Anatomy close Please confirm that you would like to log out of Medscape.\n- Although not life-threatening, allergic rhinitis can significantly impair quality of life and daily functioning.\n- [4] Next: Epidemiology In the Unit...",
      "url": "https://emedicine.medscape.com/article/889259-overview?form=fpf",
      "parent_id": null,
      "children": [
        "node_2_a8b27485",
        "node_3_f582d9a5",
        "node_4_7fc3c7f5",
        "node_5_b0d082cb",
        "node_6_b93ed36d",
        "node_7_4d8e9102",
        "node_8_4febf358",
        "node_9_50f849cf",
        "node_10_14bd5296",
        "node_11_0adacf50"
      ],
      "expanded": false,
      "node_type": "root",
      "metadata": {
        "word_count": 2612,
        "section_count": 0,
        "link_count": 0,
        "expandable": false
      }
    },
    "nodes": {
      "node_1_db170671": {
        "id": "node_1_db170671",
        "title": "Pediatric Allergic Rhinitis: Background, Epidemiology, Nasal Function and Anatomy",
        "content": "- Pediatric Allergic Rhinitis: Background, Epidemiology, Nasal Function and Anatomy close Please confirm that you would like to log out of Medscape.\n- Although not life-threatening, allergic rhinitis can significantly impair quality of life and daily functioning.\n- [4] Next: Epidemiology In the Unit...",
        "url": "https://emedicine.medscape.com/article/889259-overview?form=fpf",
        "parent_id": null,
        "children": [
          "node_2_a8b27485",
          "node_3_f582d9a5",
          "node_4_7fc3c7f5",
          "node_5_b0d082cb",
          "node_6_b93ed36d",
          "node_7_4d8e9102",
          "node_8_4febf358",
          "node_9_50f849cf",
          "node_10_14bd5296",
          "node_11_0adacf50"
        ],
        "expanded": false,
        "node_type": "root",
        "metadata": {
          "word_count": 2612,
          "section_count": 0,
          "link_count": 0,
          "expandable": false
        }
      },
      "node_2_a8b27485": {
        "id": "node_2_a8b27485",
        "title": "Rhinitis",
        "content": "Key concept: Rhinitis",
        "url": "https://duckduckgo.com/?q=Rhinitis",
        "parent_id": "node_1_db170671",
        "children": [],
        "expanded": false,
        "node_type": "concept",
        "metadata": {
          "expandable": true,
          "concept_type": "key_term",
          "clickable": true
        }
      },
      "node_3_f582d9a5": {
        "id": "node_3_f582d9a5",
        "title": "Allergic",
        "content": "Key concept: Allergic",
        "url": "https://duckduckgo.com/?q=Allergic",
        "parent_id": "node_1_db170671",
        "children": [],
        "expanded": false,
        "node_type": "concept",
        "metadata": {
          "expandable": true,
          "concept_type": "key_term",
          "clickable": true
        }
      },
      "node_4_7fc3c7f5": {
        "id": "node_4_7fc3c7f5",
        "title": "Allergy",
        "content": "Key concept: Allergy",
        "url": "https://duckduckgo.com/?q=Allergy",
        "parent_id": "node_1_db170671",
        "children": [],
        "expanded": false,
        "node_type": "concept",
        "metadata": {
          "expandable": true,
          "concept_type": "key_term",
          "clickable": true
        }
      },
      "node_5_b0d082cb": {
        "id": "node_5_b0d082cb",
        "title": "Nasal",
        "content": "Key concept: Nasal",
        "url": "https://duckduckgo.com/?q=Nasal",
        "parent_id": "node_1_db170671",
        "children": [],
        "expanded": false,
        "node_type": "concept",
        "metadata": {
          "expandable": true,
          "concept_type": "key_term",
          "clickable": true
        }
      },
      "node_6_b93ed36d": {
        "id": "node_6_b93ed36d",
        "title": "Link",
        "content": "Key concept: Link",
        "url": "https://duckduckgo.com/?q=Link",
        "parent_id": "node_1_db170671",
        "children": [],
        "expanded": false,
        "node_type": "concept",
        "metadata": {
          "expandable": true,
          "concept_type": "key_term",
          "clickable": true
        }
      },
      "node_7_4d8e9102": {
        "id": "node_7_4d8e9102",
        "title": "Pediatr",
        "content": "Key concept: Pediatr",
        "url": "https://duckduckgo.com/?q=Pediatr",
        "parent_id": "node_1_db170671",
        "children": [],
        "expanded": false,
        "node_type": "concept",
        "metadata": {
          "expandable": true,
          "concept_type": "key_term",
          "clickable": true
        }
      },
      "node_8_4febf358": {
        "id": "node_8_4febf358",
        "title": "Medline",
        "content": "Key concept: Medline",
        "url": "https://duckduckgo.com/?q=Medline",
        "parent_id": "node_1_db170671",
        "children": [],
        "expanded": false,
        "node_type": "concept",
        "metadata": {
          "expandable": true,
          "concept_type": "key_term",
          "clickable": true
        }
      },
      "node_9_50f849cf": {
        "id": "node_9_50f849cf",
        "title": "Qxmd",
        "content": "Key concept: Qxmd",
        "url": "https://duckduckgo.com/?q=Qxmd",
        "parent_id": "node_1_db170671",
        "children": [],
        "expanded": false,
        "node_type": "concept",
        "metadata": {
          "expandable": true,
          "concept_type": "key_term",
          "clickable": true
        }
      },
      "node_10_14bd5296": {
        "id": "node_10_14bd5296",
        "title": "Pediatric",
        "content": "Key concept: Pediatric",
        "url": "https://duckduckgo.com/?q=Pediatric",
        "parent_id": "node_1_db170671",
        "children": [],
        "expanded": false,
        "node_type": "concept",
        "metadata": {
          "expandable": true,
          "concept_type": "key_term",
          "clickable": true
        }
      },
      "node_11_0adacf50": {
        "id": "node_11_0adacf50",
        "title": "Asthma",
        "content": "Key concept: Asthma",
        "url": "https://duckduckgo.com/?q=Asthma",
        "parent_id": "node_1_db170671",
        "children": [],
        "expanded": false,
        "node_type": "concept",
        "metadata": {
          "expandable": true,
          "concept_type": "key_term",
          "clickable": true
        }
      }
    },
    "visualization_data": {
      "nodes": [
        {
          "id": "node_1_db170671",
          "label": "Pediatric Allergic Rhinitis: Background, Epidemiology, Nasal Function and Anatomy",
          "type": "root",
          "expandable": false,
          "expanded": false,
          "url": "https://emedicine.medscape.com/article/889259-overview?form=fpf",
          "size": 48,
          "color": "#FF6B6B",
          "shape": "circle"
        },
        {
          "id": "node_2_a8b27485",
          "label": "Rhinitis",
          "type": "concept",
          "expandable": true,
          "expanded": false,
          "url": "https://duckduckgo.com/?q=Rhinitis",
          "size": 34,
          "color": "#4ECDC4",
          "shape": "box"
        },
        {
          "id": "node_3_f582d9a5",
          "label": "Allergic",
          "type": "concept",
          "expandable": true,
          "expanded": false,
          "url": "https://duckduckgo.com/?q=Allergic",
          "size": 34,
          "color": "#4ECDC4",
          "shape": "box"
        },
        {
          "id": "node_4_7fc3c7f5",
          "label": "Allergy",
          "type": "concept",
          "expandable": true,
          "expanded": false,
          "url": "https://duckduckgo.com/?q=Allergy",
          "size": 34,
          "color": "#4ECDC4",
          "shape": "box"
        },
        {
          "id": "node_5_b0d082cb",
          "label": "Nasal",
          "type": "concept",
          "expandable": true,
          "expanded": false,
          "url": "https://duckduckgo.com/?q=Nasal",
          "size": 34,
          "color": "#4ECDC4",
          "shape": "box"
        },
        {
          "id": "node_6_b93ed36d",
          "label": "Link",
          "type": "concept",
          "expandable": true,
          "expanded": false,
          "url": "https://duckduckgo.com/?q=Link",
          "size": 34,
          "color": "#4ECDC4",
          "shape": "box"
        },
        {
          "id": "node_7_4d8e9102",
          "label": "Pediatr",
          "type": "concept",
          "expandable": true,
          "expanded": false,
          "url": "https://duckduckgo.com/?q=Pediatr",
          "size": 34,
          "color": "#4ECDC4",
          "shape": "box"
        },
        {
          "id": "node_8_4febf358",
          "label": "Medline",
          "type": "concept",
          "expandable": true,
          "expanded": false,
          "url": "https://duckduckgo.com/?q=Medline",
          "size": 34,
          "color": "#4ECDC4",
          "shape": "box"
        },
        {
          "id": "node_9_50f849cf",
          "label": "Qxmd",
          "type": "concept",
          "expandable": true,
          "expanded": false,
          "url": "https://duckduckgo.com/?q=Qxmd",
          "size": 34,
          "color": "#4ECDC4",
          "shape": "box"
        },
        {
          "id": "node_10_14bd5296",
          "label": "Pediatric",
          "type": "concept",
          "expandable": true,
          "expanded": false,
          "url": "https://duckduckgo.com/?q=Pediatric",
          "size": 34,
          "color": "#4ECDC4",
          "shape": "box"
        },
        {
          "id": "node_11_0adacf50",
          "label": "Asthma",
          "type": "concept",
          "expandable": true,
          "expanded": false,
          "url": "https://duckduckgo.com/?q=Asthma",
          "size": 34,
          "color": "#4ECDC4",
          "shape": "box"
        }
      ],
      "edges": [
        {
          "from": "node_1_db170671",
          "to": "node_2_a8b27485",
          "type": "hierarchy"
        },
        {
          "from": "node_1_db170671",
          "to": "node_3_f582d9a5",
          "type": "hierarchy"
        },
        {
          "from": "node_1_db170671",
          "to": "node_4_7fc3c7f5",
          "type": "hierarchy"
        },
        {
          "from": "node_1_db170671",
          "to": "node_5_b0d082cb",
          "type": "hierarchy"
        },
        {
          "from": "node_1_db170671",
          "to": "node_6_b93ed36d",
          "type": "hierarchy"
        },
        {
          "from": "node_1_db170671",
          "to": "node_7_4d8e9102",
          "type": "hierarchy"
        },
        {
          "from": "node_1_db170671",
          "to": "node_8_4febf358",
          "type": "hierarchy"
        },
        {
          "from": "node_1_db170671",
          "to": "node_9_50f849cf",
          "type": "hierarchy"
        },
        {
          "from": "node_1_db170671",
          "to": "node_10_14bd5296",
          "type": "hierarchy"
        },
        {
          "from": "node_1_db170671",
          "to": "node_11_0adacf50",
          "type": "hierarchy"
        }
      ],
      "layout": "hierarchical",
      "center_node": "node_1_db170671"
    },
    "style_config": {
      "layout": {
        "hierarchical": {
          "enabled": true,
          "direction": "UD",
          "sortMethod": "directed"
        }
      },
      "interaction": {
        "dragNodes": true,
        "dragView": true,
        "zoomView": true,
        "selectConnectedEdges": false
      },
      "physics": {
        "enabled": true,
        "hierarchicalRepulsion": {
          "nodeDistance": 140,
          "centralGravity": 0.0,
          "springLength": 120,
          "springConstant": 0.01,
          "damping": 0.09
        }
      },
      "nodes": {
        "borderWidth": 2,
        "shadow": true,
        "font": {
          "size": 14,
          "color": "#333333"
        }
      },
      "edges": {
        "width": 2,
        "shadow": true,
        "smooth": {
          "type": "continuous"
        }
      }
    }
  },
  "metadata": {
    "total_links": 0,
    "total_sections": 0,
    "expandable_nodes": 10
  }
}